[
 {
  "id":"US20210210079 A1",
  "title":"Processing audio data",
  "link":"https://patents.google.com/patent/US20210210079A1/",
  "authors":"Andrew R. Freed, Marco Noel, Victor Povar",
  "year": "2021",
  "date": "2021-07-08",
  "abstract": "Processing data for speech recognition by generating hypotheses from input data, assigning each hypothesis, a score according to a confidence level value and hypothesis ranking, executing a pass/fail grammar test against each hypothesis, generating replacement hypotheses according to grammar test failures, assigning each replacement hypothesis a score according to a number of hypothesis changes, and providing a set of hypotheses, wherein the set comprises at least one replacement hypotheses."
 },
 {
  "id":"US20210201016 A1",
  "title":"Classifying digital documents in multi-document transactions based on embedded dates",
  "link":"https://patents.google.com/patent/US20210201016A1/en",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2021",
  "date": "2021-07-01",
  "abstract": "A generator categorizes documents in one or more transactions into buckets, each identified by a separate category for an expected time window based on a separate relative age of each of the documents evaluated from one or more dates identified in the documents. The generator trains a document classifier with a model of the separate relative age of each of the documents as a temporal characteristic correlated with the respective category of a respective bucket of the buckets. The document classifier executes on a input documents to classify each of the input documents as a particular logical type identified by a particular category from among multiple logical types."
 },
 {
  "id":"US20210158015 A1",
  "title":"Classifying digital documents in multi-document transactions based on signatory role analysis",
  "link":"https://patents.google.com/patent/US20210158015A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2021",
  "date": "2021-05-27",
  "abstract": "A classifier receives a digital scan of a document and converts the content of the document in the digital scan from an image into text. The classifier analyzes the text to determine one or more predicted roles of one or more signatories, each predicted role determined based on one or more signature elements in the content of the document executed by the one or more signatories. The classifier evaluates each of the one or more predicted roles in view of a plurality of expected signatory role characteristics of a plurality of categories of documents of a transaction to select a particular category associated with the document from among the plurality of categories. The classifier classifies the document within the transaction as a particular logical type identified by the particular category from among a plurality of logical types for the transaction."
 },
 {
  "id":"US20210156691 A1",
  "title":"Assistive Mechanism via Edge Device Personalization ",
  "link":"https://patents.google.com/patent/US20210156691A1/",
  "authors":"Joseph N. Kozhaya, Shikhar Kwatra, Corville O. Allen, Andrew R. Freed",
  "year": "2021",
  "date": "2021-05-27",
  "abstract": "A method, system, and computer program product provide navigation guidance around various object types in a vicinity of a guidance assistance device for a user by analyzing received data regarding an environment around the guidance assistance device to identify one or more entities Ei and by applying an artificial intelligence machine learning analysis to group the one or more entities Ei into corresponding categories Cj and to determine a minimum spacing distance Dmin for each of the one or more entities Ei, wherein the minimum spacing distance Dmin is a minimum distance between the guidance assistance device and the entity Ei based on the categorization Ci specified by the user, and then providing feedback to the user when any of the one or more entities Ei is within than minimum spacing distance Dmin corresponding to said entity."
 },
 {
  "id":"US20210109993 A1",
  "title":"Semantic header detection using pre-trained embeddings ",
  "link":"https://patents.google.com/patent/US20210109993A1/",
  "authors":"Kyle G. Christianson, Hassan Nadim, Joshua S. Allen, Andrew R. Freed",
  "year": "2021",
  "date": "2021-04-15",
  "abstract": "A method, computer system, and a computer program product for detecting one or more semantic headers in one or more tabular structures by utilizing a custom pre-trained embeddings model is provided. The present invention may include receiving the custom pre-trained embeddings model. The present invention may also include computing one or more dot product values associated with the one or more tabular structures from the one or more documents based on the context of each cell associated with the one or more tabular structures in the one or more documents. The present invention may then include generating one or more similarity feature values based on the computed one or more dot product values. The present invention may further include detecting the one or more semantic headers associated with the one or more tabular structures based on the one or more similarity feature values."
 },
 {
  "id":"US20210067470 A1",
  "title":"Methods and systems for improving chatbot intent training ",
  "link":"https://patents.google.com/patent/US20210067470A1/",
  "authors":"Andrew R. Freed, Aaron T. Smith, Courtney Branson, Sorabh Murgai",
  "year": "2021",
  "date": "2021-03-04",
  "abstract": "Embodiments for managing chatbots are provided. Chatbot interaction information is received. At least one chatbot interaction within the received chatbot interaction information is identified. The at least one identified chatbot interaction includes an initial utterance provided by a user, an unsuccessful response generated responsive to the initial utterance, a subsequent utterance provided by the user, and a successful response generated responsive to the subsequent utterance. The successful response is associated with a chatbot intent. A confidence score for associating the initial utterance with utilization of the chatbot intent by a chatbot is calculated."
 },
 {
  "id":"US20210064668 A1",
  "title":"Dynamic Query Processing and Document Retrieval",
  "link":"https://patents.google.com/patent/US20210064668A1/",
  "authors":"Joseph N. Kozhaya, Shikhar Kwatra, Corville O. Allen, Andrew R. Freed",
  "year": "2021",
  "date": "2021-03-04",
  "abstract": "Embodiments relate to an intelligent computer platform to identify a lexical answer type (LAT), a first concept relevant to the received request and a second concept related to the identified first concept. The LAT, together with the first and second concepts are utilized to create a first and second cluster. Documents are selectively populated into the clusters. The clusters are subject to sorting based on a relevancy protocol."
 },
 {
  "id":"US20210042291 A1",
  "title":"Annotation Assessment and Ground Truth Construction",
  "link":"https://patents.google.com/patent/US20210042291A1",
  "authors":"Indervir Singh Banipal, Andrew R. Freed",
  "year": "2021",
  "date": "2021-02-11",
  "abstract": "Embodiments relate to an intelligent computer platform to construct ground truth data. Annotations are extracted from one or more data elements and characteristic data associated with the extracted annotations is dynamically identified. One or more models are created with the identified characteristic data. Domain activity impact is measured the accuracy of the annotation data is calculated. A policy is generated from the calculated accuracy, wherein the policy includes assigning a score to the annotation data as metadata. Compliance activities are orchestrated based on the generated policy. One or more annotations are selectively re-assigned to the data in compliance with the orchestration, and ground truth data is created from the selective re-assignment."
 },
 {
  "id":"US20210042290 A1",
  "title":"Annotation Assessment and Adjudication",
  "link":"https://patents.google.com/patent/US20210042290A1",
  "authors":"Indervir Singh Banipal, Andrew R. Freed",
  "year": "2021",
  "date": "2021-02-11",
  "abstract": "Embodiments relate to an intelligent computer platform to construct ground truth data. A document is subjected to NLP and grammatical elements of the document are identified. The identified grammatical elements are annotated and one or more annotations are assigned to the elements, with each annotation having corresponding meta-data. The assigned annotations are assessed for accuracy and a score associated with the meta-data is adjusted. The annotations are selectively re-assigned with respect to the identified grammatical elements responsive to the adjusted score. Ground truth data is constructed and the selectively re-assigned annotations are assigned to corresponding and identified grammatical elements."
 },
 {
  "id":"US20210034637 A1",
  "title":"Intelligent use of extraction techniques",
  "link":"https://patents.google.com/patent/US20210034637A1/",
  "authors":"Andrew R. Freed, Jason H. Cornpropst, Aaron T. Smith, Barton W. Emanuel",
  "year": "2021",
  "date": "2021-02-04",
  "abstract": "A set of documents is received for processing and extraction. A set of processing engines is received, and each processing engine has an expected benefit when processing a document with associated document metadata. The set of documents is analyzed to determine document metadata to be associated with the document. An expected benefit is determined for each of the documents of the set of document when the respective document is processed by a respective processing engine in the set processing engines. An expected cost for processing is determined for each of the documents in each of the set of processing engines. A processing plan for the set of documents is determined wherein the processing plan identifies a selection of documents to be run in respective processing engines of the set of processing engines based on a cost versus benefit analysis. The processing plan is executed extracting information from the identified selection of documents."
 },
 {
  "id":"US20210029141 A1",
  "title":"Detection impersonation attempts social media messaging",
  "link":"https://patents.google.com/patent/US20210029141A1",
  "authors":"Jasmeet Singh, Andrew R. Freed, Rebecca R. James, Stephen J. Roorda",
  "year": "2021",
  "date": "2021-01-28",
  "abstract": "Embodiments include a method, system and computer program product for detecting impersonation attempts in social media messaging. Aspects include receiving, via a social media network, a message from a sender to a recipient and analyzing a content of the message to extract factual statements from the message. Aspects also include analyzing a profile of the recipient to extract facts from the profile and comparing each of the factual statements to the facts from the profile. Based on a determination that one of the factual statements are verifiable by at least one of the facts, aspects include assigning a likelihood score to the factual statements. Aspects further include calculating a legitimacy score for the message based at least in part on the likelihood score of each verified factual statement from the message and transmitting the legitimacy score and the message to the recipient."
 },
 {
  "id":"US20210019307 A1",
  "title":"Natural Language-Aided Conversational Exploration of Self-Documenting Application Programming Interfaces",
  "link":"https://patents.google.com/patent/US20210019307A1/",
  "authors":"Isa M. Torres, Andrew R. Freed",
  "year": "2021",
  "date": "2021-07-18",
  "abstract": "Intent-based exploring of self-documenting Application Programming Interface (“API”) documents comprises receiving a document containing a plurality of descriptions of APIs, wherein the document is in a structured format; generating a plurality of entities by identifying a plurality of API definition entries in the document; generating a plurality of intents by iterating through a plurality of path entries in the document; generating a dialog by creating a plurality of phrases by iterating through the plurality of path entries in the document; receiving one or more questions from a user or developer; and in response to the one or more questions, providing one or more conversational responses to the user by a conversational application program incorporating the plurality of entities, plurality of intents, and plurality of phrases."
 },  {
  "id":"US20210019306 A1",
  "title":"Natural Language-Aided Conversational Exploration of Self-Documenting Application Programming Interfaces",
  "link":"https://patents.google.com/patent/US20210019306A1/",
  "authors":"Isa M. Torres, Andrew R. Freed",
  "year": "2021",
  "date": "2021-07-18",
  "abstract": "Intent-based exploring of self-documenting Application Programming Interface (“API”) documents comprises receiving a document containing a plurality of descriptions of APIs, wherein the document is in a structured format; generating a plurality of entities by identifying a plurality of API definition entries in the document; generating a plurality of intents by iterating through a plurality of path entries in the document; generating a dialog by creating a plurality of phrases by iterating through the plurality of path entries in the document; receiving one or more questions from a user or developer; and in response to the one or more questions, providing one or more conversational responses to the user by a conversational application program incorporating the plurality of entities, plurality of intents, and plurality of phrases."
 },
 {
  "id":"US20200404462 A1",
  "title":"Vehicle to vehicle messaging",
  "link":"https://patents.google.com/patent/US20200404462A1/",
  "authors":"Isa M. Torres, Andrew R. Freed, Timothy J. Hahn",
  "year": "2020",
  "date": "2020-12-24",
  "abstract": "A computer-implemented method for vehicle to vehicle messaging. The method captures a voice command of a user in a first vehicle, and extracts an intent, a target recipient, and a message payload from the captured voice command of the user, using natural language processing. The method further analyzes video content from one or more cameras of the first vehicle, and identifies the target recipient relevant to the captured voice command, based on the analyzed video content. The method further transmits the message payload to the identified target recipient based on the extracted intent. In one embodiment, the message payload is transmitted to the target recipient via peer-to-peer communication, together with one or more segments of the analyzed video content and is displayed on a user interface of the identified target recipient."
 },
 {
  "id":"US20200387571 A1",
  "title":"Relevancy as an indicator for determining document quality",
  "link":"https://patents.google.com/patent/US20200387571A1/",
  "authors":"David Contreras, Krishna Mahajan, Roberto DeLima, Andrew R. Freed, Brien Muschett",
  "year": "2020",
  "date": "2020-12-10",
  "abstract": "A method, computer system, and a computer program product for relevancy-based document quality assessment is provided. The present invention may include computing a document quality score based on at least one container relevancy score determined based on at least one domain link to a domain knowledge base."
 },
 {
  "id":"US20200364511 A1",
  "title":"Retraining a conversation system based on negative feedback",
  "link":"https://patents.google.com/patent/US20200364511A1/",
  "authors":"Jason M. Brown, Andrew R. Freed, Aaron T. Smith, Joshua S. Allen, Ryan S. Brink",
  "year": "2020",
  "date": "2020-11-19",
  "abstract": "A method retrains a cognitive interaction information system. One or more processors monitors an interactive communication between a user and the cognitive interactive information system. The processor(s) identifies an incorrect answer returned by the cognitive interactive information system to a question asked by the user; reevaluates the question utilizing alternative intent classifications to form alternative answers; and presents the alternative answers to the user. The processor(s) receive a selection from the alternative answers from the user; updates processing rules to generate updated processing rules that are based on the selection; and retrains the cognitive interaction information system based on the updated processing rules."
 },
 {
  "id":"US20200335090 A1",
  "title":"Protecting chat with artificial intelligence",
  "link":"https://patents.google.com/patent/US20200335090A1/",
  "authors":"Andrew R. Freed, Sorabh Murgai, Aaron T. Smith, Devasena Vridhachalam, Jasmeet Singh, Rebecca R. James",
  "year": "2020",
  "date": "2020-10-22",
  "abstract": "A method, computer system, and computer program product for chat protection. The embodiment may include receiving, in a chat session, a user-spoken communication and one or more inputs specific to a software program. The embodiment may also include predicting a next communication by the user based on the received user spoken communication and the one or more inputs. The embodiment may further include, in response to the predicted next communication containing untoward content, performing a remedial action."
 }, {
  "id":"US20200335089 A1",
  "title":"Protecting chat with artificial intelligence",
  "link":"https://patents.google.com/patent/US20200335089A1/",
  "authors":"Andrew R. Freed, Sorabh Murgai, Aaron T. Smith, Devasena Vridhachalam, Jasmeet Singh, Rebecca R. James",
  "year": "2020",
  "date": "2020-10-22",
  "abstract": "A method, computer system, and computer program product for chat protection. The embodiment may include receiving, in a chat session, a user-spoken communication and one or more inputs specific to a software program. The embodiment may also include predicting a next communication by the user based on the received user spoken communication and the one or more inputs. The embodiment may further include, in response to the predicted next communication containing untoward content, performing a remedial action."
 },
 {
  "id":"US20200334546 A1",
  "title":"Document type-specific quality model",
  "link":"https://patents.google.com/patent/US20200334546A1/",
  "authors":"David Contreras, Krishna Mahajan, Roberto DeLima, Andrew R. Freed, Brien Muschett",
  "year": "2020",
  "date": "2020-10-22",
  "abstract": "An approach is provided that receives a document and a document type of the document. The document type identifies a document category to which the received document belongs. A set of linguistic metrics are retrieved that correspond to the document type. A quality of the received document is automatically determined based on a set of linguistic features found in the document as compared to the retrieved set of linguistic metrics. The document is then ingested into a corpus that is utilized by a question-answering (QA) system. The ingestion of the document is based on the determined quality."
 },
 {
  "id":"US20200210476 A1",
  "title":"Form-based transactional conversation system design ",
  "link":"https://patents.google.com/patent/US20200210476A1/",
  "authors":"Joseph N. Kozhaya, Shikhar Kwatra, Corville O. Allen, Andrew R. Freed",
  "year": "2020",
  "date": "2020-10-22",
  "abstract": "A method, computer system, and computer program product for form-based conversation system design are provided. The embodiment may include ingesting, by a processor, a plurality of forms from a given domain. The embodiment may also include extracting indicators of required input fields from the ingested plurality of forms. The embodiment may further include generating a required input list based on the extracted indicators of the required input fields to update a size of the required input list. The embodiment may also include determining transactional intents based on the required input list. The embodiments may further include generating a dialog flow that satisfies the determined transactional intents."
 }, {
  "id":"US20200334333 A1",
  "title":"Form-based transactional conversation system design ",
  "link":"https://patents.google.com/patent/US20200334333A1/",
  "authors":"Joseph N. Kozhaya, Shikhar Kwatra, Corville O. Allen, Andrew R. Freed",
  "year": "2020",
  "date": "2020-10-22",
  "abstract": "A method, computer system, and computer program product for form-based conversation system design are provided. The embodiment may include ingesting, by a processor, a plurality of forms from a given domain. The embodiment may also include extracting indicators of required input fields from the ingested plurality of forms. The embodiment may further include generating a required input list based on the extracted indicators of the required input fields to update a size of the required input list. The embodiment may also include determining transactional intents based on the required input list. The embodiments may further include generating a dialog flow that satisfies the determined transactional intents."
 },
 {
  "id":"US20200210476 A1",
  "title":"Implementing enhanced devops process for cognitive search solutions",
  "link":"https://patents.google.com/patent/US20200210476A1/",
  "authors":"Javier Ricardo Torres, Joseph N. Kozhaya, Andrew R. Freed, Corville O. Allen, Shikhar Kwatra",
  "year": "2020",
  "date": "2020-10-22",
  "abstract": "A method and system are provided for implementing enhanced cognitive searches optimized to integrate deployment with development testing. An initial body of works is ingested into a system capable of answering questions. A series of queries is analyzed against the initial body of works utilizing a set of scorers utilizing criteria to form assessments, wherein each scorer uses the criteria against the query and the initial body of works to form the assessment. The assessments are analyzed to determine a usefulness of a set of entries in the initial body of works. Content are deployed using the identified selected first set of entries as deployment ready, enabling enhanced cognitive search results."
 },
 {
  "id":"US20200210476 A1",
  "title":"Dynamically networked integrated swarm sensor tracking",
  "link":"https://patents.google.com/patent/US20200210476A1/",
  "authors":"Joseph N. Kozhaya, Shikhar Kwatra, Corville O. Allen, Andrew R. Freed",
  "year": "2020",
  "date": "2020-10-15",
  "abstract": "A computer-implemented method includes initiating a plurality of devices, each device corresponding to a member of a group, the group including a plurality of members; monitoring proximity information for each of the plurality of devices relative to at least one other one of the plurality of devices; establishing a maximum distance for the devices to be spaced from each other; and in response to one of the devices being separated from another of the devices by more than the maximum distance, sending an alert to at least one of remaining devices."
 },
 {
  "id":"US20200210476 A1",
  "title":"Headstart for Data Scientists",
  "link":"https://patents.google.com/patent/US20200210476A1/",
  "authors":"Andrew R. Freed, Tristan A. Tenyenhuis, Keith D. Cramer, Sorabh Murgai",
  "year": "2020",
  "date": "2020-10-15",
  "abstract": "A method, system, and apparatus are provided for recommending machine learning (ML) project resources for completing a user project by generating indexed project metadata for a plurality of ML projects, generating search metadata for a search request for ML project resources to develop an ML project, and then evaluating the search metadata against the indexed project metadata for each ML project to form a relevancy assessment which is used to order trained models from the ML projects and to display one or more recommended ML project resources comprising one or more of the plurality of trained models having a relevancy assessment exceeding a relevancy threshold."
 },
 {
  "id":"US20200210476 A1",
  "title":"Client-specific document quality model",
  "link":"https://patents.google.com/patent/US20200210476A1/",
  "authors":"David Contreras, Krishna Mahajan, Roberto DeLima, Andrew R. Freed, Brien Muschett",
  "year": "2020",
  "date": "2020-09-24",
  "abstract": "A computer-implemented method, system and computer program product for generating a client-specific document quality model, by: analyzing data using existing quality heuristics to identify new, unexpected or problem patterns in the data; forming the quality heuristics into one or more clusters for each container level of the data; exploring each of the clusters to identify sources of the patterns; and developing new quality heuristics based on the sources of the patterns, wherein the new quality heuristics are used to generate the client-specific document quality model."
 },
 {
  "id":"US20200210476 A1",
  "title":"Information extraction from open-ended schema-less tables",
  "link":"https://patents.google.com/patent/US20200210476A1/",
  "authors":"Joshua S. Allen, Andrew R. Freed, Thai T. La",
  "year": "2020",
  "date": "2020-09-24",
  "abstract": "Systems and methods for generating and annotating cell documents include extracting tables from a document using a table extraction engine. Headers are extracted for each of the tables using a header detection engine. Cells are extracted from each of the tables using a cell extraction engine. A cell document is generated for each of the cells which are each correlated to corresponding portions of the headers, each cell document recording the correlation between the cells and the headers. Each cell document is annotated to generate annotated cell documents with a cell recognition model trained to perform natural language processing on the cell documents by classifying each term in each of the cell documents and extracting relationships between the terms of each of the cell documents."
 },
 {
  "id":"US20200210476 A1",
  "title":"System for Minimizing Reevaluation of a Ground Truth Corpus in Response to Concept Drift",
  "link":"https://patents.google.com/patent/US20200210476A1/",
  "authors":"Tristan A. Tenyenhuis, Andrew R. Freed, Jocelyn Kong, Allegra Larche, Christopher R. Weber",
  "year": "2020",
  "date": "2020-07-30",
  "abstract": "A method, system and computer-usable medium are disclosed for minimizing reevaluation of a ground truth corpus in response to concept drift. Certain embodiments are directed to a computer implemented comprising: generating a knowledge graph using a ground truth corpus, where the knowledge graph includes concept nodes, context definition nodes, and document nodes, where each concept node has one or more edges to a context definition node and to a document node; updating a context definition node in the knowledge graph based on context drift; identifying edges between the updated context definition node and concept nodes affected by the updated context definition; and identifying edges between the affected concept nodes and corresponding document nodes to identify document nodes affected by the context drift; and reevaluating documents in the ground truth corpus corresponding to the affected document nodes pursuant to updating the ground truth corpus to compensate for the context drift."
 },
 {
  "id":"US20200210476 A1",
  "title":"Evaluating retraining recommendations for an automated conversational service",
  "link":"https://patents.google.com/patent/US20200210476A1/",
  "authors":"Tristan A. Tenyenhuis, Isa M. Torres, Andrew R. Freed, Barton W. Emanuel",
  "year": "2020",
  "date": "2020-07-23",
  "abstract": "A retraining service accesses conversational logs, each of the conversational logs recording a separate conversation, between a separate user and a conversational service, and at least one outcome identified with the separate conversation. The retraining service assess, from the conversational logs, at least one conversation gap and response with the at least one outcome matching a type of outcome that indicates the response impacted user experience in a negative way from among types of outcomes. The retraining service evaluates one or more recommendations for retraining the response to promote a positive type of outcome from among the types of outcomes. The retraining service outputs the one or more recommendations to the conversational service for directing retraining of the response by the conversational service."
 },
 {
  "id":"US20200210476 A1",
  "title":"Dynamic Natural Language Processing",
  "link":"https://patents.google.com/patent/US20200210476A1/",
  "authors":"Joseph N. Kozhaya, Shikhar Kwatra, Corville O. Allen, Andrew R. Freed",
  "year": "2020",
  "date": "2020-07-16",
  "abstract": "Embodiments relate to an intelligent computer platform to support natural language (NL) processing. The request is analyzed and a lexical answer type (LAT) related to the received request is identified. A knowledge graph (KG) related to the LAT is identified and leveraged to extract a first concept related to the LAT and a second concept related to the first concept. First and second cluster are created, with the first cluster having the LAT and first concept as qualifiers, and the second cluster having the first and second concepts as qualifiers. Each of the formed clusters is populated with one or more documents. An inter-cluster assessment is conducted based on the relevancy of the populated document(s) to the received input. In addition, a machine learning model (MLM) corresponding to the KG is identified and utilized to selectively augment the MLM with the LAT, first and second concepts, and a corresponding relationship to the inter-cluster assessment."
 },
 {
  "id":"US20200210476 A1",
  "title":"Dynamic Query Processing and Document Retrieval",
  "link":"https://patents.google.com/patent/US20200210476A1/",
  "authors":"Joseph N. Kozhaya, Shikhar Kwatra, Corville O. Allen, Andrew R. Freed",
  "year": "2020",
  "date": "2020-07-16",
  "abstract": "Embodiments relate to an intelligent computer platform to receive a request for processing against a corpus. The request is analyzed and a lexical answer type (LAT), a first concept relevant to the received request and a second concept related to the identified first concept, are each identified. The LAT, together with the first and second concepts are utilized to create a first and second cluster. Documents are selectively populated into the clusters based on the respective LAT and concept qualifiers. The clusters are subject to sorting based on relevancy to the received request."
 },
 {
  "id":"US20200210476 A1",
  "title":"Personalized video and memories creation based on enriched images ",
  "link":"https://patents.google.com/patent/US20200210476A1/",
  "authors":"Joseph N. Kozhaya, Shikhar Kwatra, Corville O. Allen, Andrew R. Freed",
  "year": "2020",
  "date": "2020-07-02",
  "abstract": "A method for creating content includes making a corpus of images available, adding a plurality of tag data to each of the images, receiving a query, extracting a trigger from the query, identifying a set of the images in the corpus, wherein identified images have tag data matching the extracted trigger, and creating a video comprising the identified images."
 },
 {
  "id":"US20200210258 A1",
  "title":"Validation Framework for Runtime Connected API Systems",
  "link":"https://patents.google.com/patent/US20200210258A1/",
  "authors":"Keith D. Cramer, Andrew R. Freed, Tristan A. Tenyenhuis",
  "year": "2020",
  "date": "2020-07-02",
  "abstract": "Provided is a validation framework for modelling possible failures that might occur when an orchestrated transaction calls external services to ensure that error handling and reporting is robust and well designed. The disclosed techniques ensure that no changes are necessary to either the code making a call or the services that might be called. The techniques are not limited to web servers and REST APIs as they may be used to test and validate any kind of system that employs well defined APIs. The claimed subject matter, or “validation framework” may be added to an existing API or created as a new module that acts as a proxy server in a non-micro service type of system. Although described with respect to a gateway-API service, the claimed subject matter is equally applicable to other systems that process orchestrated transactions."
 },
 {
  "id":"US20200152173 A1",
  "title":"Training artificial intelligence to respond to user utterances",
  "link":"https://patents.google.com/patent/US20200152173A1/",
  "authors":"Aaron T. Smith, Andrew R. Freed, Joshua S. Allen, Jason M. Brown, Ryan S. Brink, Sorabh Murgai",
  "year": "2020",
  "date": "2020-05-14",
  "abstract": "A method improves a functionality of a conversational agent that is generated by an artificial intelligence (AI) system. A conversational agent receives a first utterance from a first entity. The AI system identifies an unverified response to the first utterance; sends the unverified response to the first entity; and receives a positive feedback indication about the unverified response from the first entity. The AI system searches a data store in order to identify an entry for a second utterance by a second entity, where the second entity has sent a positive feedback for the unverified response. The AI system sends the second utterance and the unverified response to the first entity, and receives a positive feedback for the unverified response to the second utterance from the first entity in order to mark the unverified response as a verified response, which responds to future receipts of the first utterance."
 },
 {
  "id":"US20200151555 A1",
  "title":"Detecting and reducing bias in machine learning models",
  "link":"https://patents.google.com/patent/US20200151555A1/",
  "authors":"Joseph N. Kozhaya, Shikhar Kwatra, Corville O. Allen, Andrew R. Freed",
  "year": "2020",
  "date": "2020-05-24",
  "abstract": "A method identifies and removes bias from a machine learning model. A user/computer inputs a plurality of input training data into a machine learning system to generate an output of labeled output data. The user/computer evaluates the labeled output data according to a consistency metric to associate the labeled output data with a corresponding consistency assessment. The user/computer selects each labeled output data having a consistency assessment indicating a consistency assessment that is greater than a predetermined threshold to form a labeled output data subset, and then creates additional labeling for the labeled output data subset. The user/computer utilizes the additional labeling to distinguish each labeled training data from labeled output data subset as being mislabeled and biased, and then adjusts the learning machine based on the labeled output data subset being mislabeled and biased."
 },
 {
  "id":"US20200125827 A1",
  "title":"Classifying digital documents in multi-document transactions based on signatory role analysis",
  "link":"https://patents.google.com/patent/US20200125827A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2020",
  "date": "2020-04-23",
  "abstract": "A classifier receives a document and analyzes the document to determine one or more predicted roles of one or more signatories, each predicted role determined based on one or more signature elements in the content of the document executed by the one or more signatories. The classifier evaluates each of the one or more predicted roles in view of a plurality of expected signatory role characteristics of a plurality of categories of documents of a transaction to select a particular category associated with the document from among the plurality of categories. The classifier classifies the document within the transaction as a particular logical type identified by the particular category from among a plurality of logical types for the transaction."
 },
 {
  "id":"US20200104350 A1",
  "title":"Information extraction from open-ended schema-less tables",
  "link":"https://patents.google.com/patent/US20200104350A1/",
  "authors":"Joshua S. Allen, Andrew R. Freed, Thai T. La",
  "year": "2020",
  "date": "2020-04-02",
  "abstract": "Systems and methods for generating and annotating cell documents include extracting tables from a document using a table extraction engine. Headers are extracted for each of the tables using a header detection engine. Cells are extracted from each of the tables using a cell extraction engine. A cell document is generated for each of the cells which are each correlated to corresponding portions of the headers, each cell document recording the correlation between the cells and the the headers. Each cell document is annotated to generate annotated cell documents with a cell recognition model trained to perform natural language processing on the cell documents by classifying each term in each of the cell documents and extracting relationships between the terms of each of the cell documents."
 },
 {
  "id":"US20200097759 A1",
  "title":"Table Header Detection Using Global Machine Learning Features from Orthogonal Rows and Columns",
  "link":"https://patents.google.com/patent/US20200097759A1/",
  "authors":"Kyle G. Christianson, Hassan Nadim, Joshua S. Allen, Andrew R. Freed",
  "year": "2020",
  "date": "2020-03-26",
  "abstract": "A method, system and computer-usable medium for detecting headers in various documents, such as PDF and HTML files. The files are converted to a two dimensional array or table, having orthogonal rows and columns. Either rows or columns are determined to include headers. For determining if rows include headers. For each row in the array or table, pair wise comparison is performed for each cell of each column that is orthogonal to that row. The pair wise comparison scores or values are summed up for each orthogonal column to that row and the sum across for all the orthogonal columns to row provide a score or value for that row. Row scores are evaluated relative to one another to determine likelihood of headers in the row. For determining if columns have headers, similar calculation is performed between columns and their orthogonal rows."
 },
 {
  "id":"US20200097541 A1",
  "title":"System for Extracting Header Labels for Header Cells in Tables Having Complex Header Structures ",
  "link":"https://patents.google.com/patent/US20200097541A1/",
  "authors":"Kyle G. Christianson, Hassan Nadim, Joshua S. Allen, Andrew R. Freed",
  "year": "2020",
  "date": "2020-03-26",
  "abstract": "A method, system and computer-usable medium are disclosed for associating data cells with headers and header labels. In certain embodiments, a table having rows and columns is received, wherein the table includes a plurality of cells, wherein each cell is populated with at least one of a header name, data value, or no information. A determination is made as to whether a cell is a header cell or data cell. If the cell is a header cell, current list of column and current list of row headers are dynamically updated. The current list of column and row headers are assigned to the cell regardless of whether the cell is a header cell or data cell. Headers associated with header cells are used to identify label candidates for the header name of the header cell. The labels may be used to provide additional context for headers within a data cell."
 },
 {
  "id":"US20200097533 A1",
  "title":"System for Associating Data Cells with Headers in Tables Having Complex Header Structures",
  "link":"https://patents.google.com/patent/US20200097533A1/",
  "authors":"Kyle G. Christianson, Hassan Nadim, Joshua S. Allen, Andrew R. Freed",
  "year": "2020",
  "date": "2020-03-26",
  "abstract": "A method, system and computer-usable medium are disclosed for associating data cells with headers and tables having one or more embedded header structures. In certain embodiments, a table having rows and columns is received, wherein the table includes a plurality of cells, wherein each cell is populated with at least one of a header name, data value, or no information, the table having at least one embedded header. A determination is made as to whether a cell is a header cell or data cell. If the cell is a header cell, a count of consecutive column headers is maintained. A current list of column headers is dynamically updated based on the count of the consecutive column headers. Upon encountering a data cell, the current list of column headers is assigned to the data cell."
 },
 {
  "id":"US20200097532 A1",
  "title":"Intelligent Normalization and De-Normalization of Tables for Multiple Processing Scenarios",
  "link":"https://patents.google.com/patent/US20200097532A1/",
  "authors":"Kyle G. Christianson, Hassan Nadim, Joshua S. Allen, Andrew R. Freed",
  "year": "2020",
  "date": "2020-03-26",
  "abstract": "A method, system and computer-usable medium are disclosed for finding vertically and horizontally aligned cells in a complex table structure. A file or document, such as an HTML file that defines a complex table includes spanning rows and columns is expanded into a two dimensional (2D) array or table with orthogonal rows and columns, where the spanning rows and columns included cells with copied values or object references. The expanded 2D array or table can be deduplicated row or column wise to determine header alignment of the table."
 },
 {
  "id":"US20200034732 A1",
  "title":"System and Method for Automated Analysis of Ground Truth Using Confidence Model to Prioritize Correction Options",
  "link":"https://patents.google.com/patent/US20200034732A1/",
  "authors":"Andrew R. Freed, Kyle G. Christianson, Christopher Phipps",
  "year": "2020",
  "date": "2020-01-30",
  "abstract": "A method, system and computer-usable medium are disclosed for automated analysis of ground truth using confidence model to prioritize correction options. In certain embodiments, the ground truth data is analyzed to identify review-candidates. A confidence level may be assigned to each of the identified review-candidates and the review-candidates are prioritized, at least in part, using the assigned confidence levels. The review-candidates are electronically presented in prioritized order to solicit verification or correction feedback for updating the ground truth data"
 },
 {
  "id":"US20200005032 A1",
  "title":"Classifying digital documents in multi-document transactions based on embedded dates",
  "link":"https://patents.google.com/patent/US20200005032A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2020",
  "date": "2020-01-02",
  "abstract": "A classifier receives a document from a multi-document transaction. The classifier analyzes the document to identify one or more embedded dates in the content of the document and context of one or more positions of the one or more embedded dates in the document. The classifier evaluates each of the one or more embedded dates based on the separate context of each of the one or more positions within the document and a relative age of the one or more embedded dates in view of temporal characteristics of multiple categories of documents of a transaction to select a particular category associated with the document from among the multiple categories. The classifier classifies the document within the transaction as a particular logical type identified by the particular category from among multiple logical types."
 },
 {
  "id":"US20190391956 A1",
  "title":"Cloud Sharing and Selection of Machine Learning Models for Service Use ",
  "link":"https://patents.google.com/patent/US20190391956A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Joseph N. Kozhaya",
  "year": "2019",
  "date": "2019-11-26",
  "abstract": "An approach is provided in which an information handling system performs multiple tests using a cognitive service and multiple trained machine learning models on user data corresponding to a user application. For each of the multiple tests, a different one of the trained machine learning models is utilized. The information handling system generates results from the tests and then selects at least one of the trained machine learning models based on the test results. In turn, the information handling system assigns the cognitive service and the selected trained machine learning models to the user application."
 },
 {
  "id":"US20190370540 A1",
  "title":"Electronic Document Classification System Optimized for Combining a Plurality of Contemporaneously Scanned Documents ",
  "link":"https://patents.google.com/patent/US20190370540A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2019",
  "date": "2019-12-05",
  "abstract": "A method, system and computer-usable medium for classifying a source document using sub-documents identified in the source document. The method, system, and computer-usable medium are used to access the source document from electronic memory. The source document is electronically searched to detect markers indicative of whether the source document includes one or more sub-documents. Incongruities in the source document are located using the detected markers and the source document is split into sub-documents at the located incongruities. Each of the sub-documents is classified. The sub-documents are joined as a re-assembled source document with classifications including classifications for one or more of the sub-documents."
 },
 {
  "id":"US20190361980 A1",
  "title":"Inferring confidence and need for natural language processing of input data ",
  "link":"https://patents.google.com/patent/US20190361980A1/",
  "authors":"Troy Biesterfeld, Andrew R. Freed, Elizabeth T. Dettman, Jeremy J Salsman, Paul R Chmielewski",
  "year": "2019",
  "date": "2019-11-28",
  "abstract": "Improved data ingestion techniques are provided. A data set comprising records is received, where each record contains one or more fields. A group of fields is identified, where each of the fields has a common metadata attribute. Metrics are determined for the group based on metadata associated with each field, and weight values are assigned to each of the metrics. A natural language processing (NLP) measure and a discreteness measure are generated for the group of fields based on the metrics and the weight values. A processing workflow is selected to use when ingesting data from the group of fields into a corpus, based on comparing the NLP measure and the discreteness measure to one or more predefined thresholds, and each of the fields in the group of fields are processed using the processing workflow."
 },
 {
  "id":"US20190354555 A1",
  "title":"Dynamic faceting for personalized search and discovery",
  "link":"https://patents.google.com/patent/US20190354555A1/",
  "authors":"Andrew R. Freed, Norbert Herman, Shubhadip Ray, Avik Sanyal",
  "year": "2019",
  "date": "2019-11-21",
  "abstract": "Methods, computer program products, and systems are presented. The methods include, for instance: determining user clusters and navigation-type clusters based on multiple information requests, and training facets and corresponding usefulness factor of the facets from the multiple information requests by machine learning. When a user submits a query, the user and the query is respectively mapped with one of the user clusters and the navigation-type clusters, and the query is customized based on the associated pair of clusters. Results of the query are obtained, ranked by usefulness of the facets as determined according to the pair of clusters, and presented to the user."
 },
 {
  "id":"US20190332644 A1",
  "title":"Machine learned document loss recovery",
  "link":"https://patents.google.com/patent/US20190332644A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2019",
  "date": "2019-10-31",
  "abstract": "A computer-implemented method includes receiving first lossy converted documents. The computer-implemented method includes generating corrected documents for the first lossy converted documents. Each of the corrected documents includes edit markers that reflect structure changes relative to a corresponding document of the first lossy converted documents. The computer-implemented method includes generating feature vectors for the first lossy converted documents. The feature vectors include structure features of the first lossy converted documents. The computer-implemented method includes training one or more models based on the structure features and the edit markers. The computer-implemented method includes applying the trained one or more models to second lossy converted documents to determine proposed structure edits. The computer-implemented method includes transforming the second lossy converted documents to second corrected documents by applying one or more of the proposed structure edits."
 },
 {
  "id":"US20190286688 A1",
  "title":"Inserting links that aid action completion",
  "link":"https://patents.google.com/patent/US20190286688A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2019",
  "date": "2019-09-19",
  "abstract": "Based on natural language processing of a passage of a first electronic document, a determination is made that the passage indicates an action to be undertaken. In response to this determination and based on an analysis of a second electronic document, the second electronic document is identified as incorporating content preconfigured to allow completion of the action. In response to this identification, the passage is linked to the second electronic document."
 },
 {
  "id":"US20190258659 A1",
  "title":"Analogy Outcome Determination",
  "link":"https://patents.google.com/patent/US20190258659A1/en",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2019",
  "date": "2019-08-22",
  "abstract": "Embodiments relate to a system, program product, and method for use with an intelligent computer platform to decipher analogical phrases. The method identifies A category is identified and a list of definitions is created for each parsed subcomponent of the phrase. The definitions are ranked in the list based on their relevance to the identified category and an outcome is identified based on the ranked relevance. A corpus is searched for evidence of an analogical pattern associated with the ranked list and each entry in the ranked list is scored based on congruence with the analogical pattern. An outcome is generated based on the scoring and is representative of the definition with the strongest congruence to the analogical pattern."
 },
 {
  "id":"US20190243895 A1",
  "title":"Contextual Analogy Representation",
  "link":"https://patents.google.com/patent/US20190243895A1/en?oq=20190243895",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2019",
  "date": "2019-08-08",
  "abstract": "Embodiments relate to an intelligent computer platform to provide a contextual analogy response. The aspect of providing a contextual analogy response includes denoting an analogy phrase within a communication. An anaphora within the analogy phrase is detected and a set of sentences are parsed into grammatical components wherein the grammatical type for each parsed component is identified. A sentence is created with the detected anaphora and an action term from the analogy phrase. The set of sentences and the analogy phrase are matched with the identified components that are assigned to a solved analogy association. A related contextual response is attached to the solved analogy association to generate the outputted analogy response."
 },
 {
  "id":"US20190236131 A1",
  "title":"Linguistic based determination of text location origin",
  "link":"https://patents.google.com/patent/US20190236131A1/",
  "authors":"Corville O. Allen, Roberto DeLima, Andrew R. Freed, Robert L. Nielsen",
  "year": "2019",
  "date": "2019-08-01",
  "abstract": "A method and system for determining a location of origin and a time period in which a document was written is disclosed. A text is received and a set of linguistic characteristics for the text are identified. A set of possible locations and time periods for the text are determined based on the set of linguistic characteristics. A set of reference documents are used to determine a proximity rating for the text based upon a determination of how close the text is to the reference documents. The potential locations and time periods are ranked and returned for presentation."
 },
 {
  "id":"US20190220385 A1",
  "title":"Applying consistent log levels to application log messages ",
  "link":"https://patents.google.com/patent/US20190220385A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Scott N. Gerard, Dorian B. Miller",
  "year": "2019",
  "date": "2019-07-18",
  "abstract": "A method is provided for analyzing log message content. The computer-implemented method may include detecting, by at least one processor, log messages in an application code, identifying a log level assigned to each of the log messages, and performing natural language processing (NLP) analysis on each of the log messages by using at least keyword and synonym matching percentage analysis criteria. The computer-implemented method may further include determining, in response to the NLP analysis, a severity score of each of the log messages, and reclassifying, based on the severity score, the assigned log level of one or more of the log messages to a different log level."
 },
 {
  "id":"US20190164095 A1",
  "title":"Natural language processing of feeds into functional software input",
  "link":"https://patents.google.com/patent/US20190164095A1/",
  "authors":"Kelly A. Argyros, Michael A. Dawson, Daniel J. Ferranti, Andrew R. Freed, Andrew S.H. Ting",
  "year": "2019",
  "date": "2019-05-30",
  "abstract": "A method, in a data processing system comprising a processor and a memory, for processing natural language feeds to software, the method comprising receiving, by the data processing system, a natural language feed including data that is representative of parameters and quantitative data from government or regulatory body data sources, parsing, by the data processing system, the natural language feed with natural language processing for features that correspond to a production system, converting, by the data processing system, the parsed natural language feed into software functions, and calibrating, by the data processing system, the production system by updating a data library using the software functions and integrating information from the data library with the production system."
 },
  {
  "id":"US20190164061 A1",
  "title":"Analyzing product feature requirements using machine-based learning and information retrieval",
  "link":"https://patents.google.com/patent/US20190164061A1/",
  "authors":"Andrew R. Freed, Joan W. Tomlinson",
  "year": "2019",
  "date": "2019-05-30",
  "abstract": "A method and system that includes a data processing system comprising a processor, a memory and an artificial intelligence unit for retrieving information using a knowledge representation. The method comprising receiving, by the data processing system, a selection of a product from a computing device, parsing, by the data processing system, features of the product from product data input, generating, by the data processing system, queries from the parsed features, determining, by the data processing system, candidate answers for the queries, identifying, by the data processing system, requirements for the product based on the candidate answers, and providing, by the data processing system, the requirements to the computing device."
 },
  {
  "id":"US20190164016 A1",
  "title":"Clustering subject matter experts based on question and answer ratings",
  "link":"https://patents.google.com/patent/US20190164016A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Joseph N. Kozhaya",
  "year": "2019",
  "date": "2019-05-30",
  "abstract": "Software that performs the following operations: (i) receiving descriptive information associated with a domain expert; (ii) receiving a question and a corresponding candidate answer for the question; (iii) determining a set of scoring features to be used to evaluate the candidate answer, wherein the set of scoring features includes: at least one scoring feature pertaining to the question, at least one scoring feature pertaining to the candidate answer, and at least one scoring feature pertaining to the descriptive information; (iv) receiving a score from the domain expert, wherein the score is based, at least in part, on the domain expert's evaluation of the candidate answer; (v) generating a feature vector based on the set of scoring features; (vi) cross-correlating the feature vector with the score; and (vii) clustering the domain expert with one or more other domain experts according to the cross-correlation, thereby creating a first cluster."
 },
  {
  "id":"US20190163706 A1",
  "title":"Ingesting documents using multiple ingestion pipelines",
  "link":"https://patents.google.com/patent/US20190163706A1/",
  "authors":"Pamela D. Andrejko, Andrew R. Freed, Cynthia M. Murch, Jan M. Nordland, Humberto R. Rivero",
  "year": "2019",
  "date": "2019-01-31",
  "abstract": "A primary ingestion pipeline configured for use in natural language processing includes annotators configured for annotating documents. The annotators and documents to be annotated are evaluated. Based on the evaluations, an ingestion risk score is generated for each document. Each ingestion risk score represents a likelihood that an associated document will not successfully be annotated by the annotators. Each ingestion risk score is compared to a set of risk criteria. Based on the comparisons, a determination is made that each document of a first set of documents satisfies the set of risk criteria. A further determination is made, based on the comparisons, that each document of a second set of documents does not satisfy the set of risk criteria. In response to these determinations, the first set of documents is entered into the primary ingestion pipeline and the second set of documents is provided special handling."
 },
 { 
  "id":"US20190050474 A1",
  "title":"User interaction during ground truth curation in a cognitive system",
  "link":"https://patents.google.com/patent/US20190050474A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Sorabh Murgai",
  "year": "2019",
  "date": "2019-02-14",
  "abstract": "An embodiment of the invention may include a method, computer program product, and system for generating ground truth data for a plurality of cognitive capabilities within an overall cognitive system. The embodiment may include configuring multiple sets of training data. Each set of training data corresponds to a separate cognitive capability. The embodiment may include displaying a set of ground truth curation activities via a user interface. The embodiment may include determining the ground truth curation activities performed for a first type of data for a first duration. The first type of data is selected from the single set of grouped training data. The embodiment may include determining whether the first duration has exceeded a pre-determined threshold. The embodiment may include switching the curation activities to a second type of data. The second type of data is selected from the single set of grouped data."
 },
 { 
  "id":"US20190050472 A1",
  "title":"User interaction during ground truth curation in a cognitive system",
  "link":"https://patents.google.com/patent/US20190050472A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Sorabh Murgai",
  "year": "2019",
  "date": "2019-02-14",
  "abstract": "An embodiment of the invention may include a method, computer program product, and system for generating ground truth data for a plurality of cognitive capabilities within an overall cognitive system. The embodiment may include configuring multiple sets of training data. Each set of training data corresponds to a separate cognitive capability. The embodiment may include displaying a set of ground truth curation activities via a user interface. The embodiment may include determining the ground truth curation activities performed for a first type of data for a first duration. The first type of data is selected from the single set of grouped training data. The embodiment may include determining whether the first duration has exceeded a pre-determined threshold. The embodiment may include switching the curation activities to a second type of data. The second type of data is selected from the single set of grouped data."
 },
 { 
  "id":"US20190026654 A1",
  "title":"Bootstrapping Multiple Varieties of Ground Truth for a Cognitive System",
  "link":"https://patents.google.com/patent/US20190026654A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Sorabh Murgai",
  "year": "2019",
  "date": "2019-01-24",
  "abstract": "Curating high-quality ground truth is an important but difficult part of training a cognitive system. The invention greatly simplifies this process by determining the value that particular training data has in improving existing ground truth. Candidate training data of different types (text, audio, images) is extracted from an interaction log, and each entry is analyzed to arrive at a training value score. The analysis generates multiple component scores which are combined for the final score. The component scores may include a per-feature variability score, a cross-feature variability score, and an accuracy score. A set of the unverified entries may be presented to a user based on the training value scores, and the user can select which of the entries in the set should be included as new ground truths. The ground truths can then be updated by adding the selected entries."
 }, 
 { 
  "id":"US20190026650 A1",
  "title":"Bootstrapping Multiple Varieties of Ground Truth for a Cognitive System",
  "link":"https://patents.google.com/patent/US20190026650A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Sorabh Murgai",
  "year": "2019",
  "date": "2019-01-24",
  "abstract": "Curating high-quality ground truth is an important but difficult part of training a cognitive system. The invention greatly simplifies this process by determining the value that particular training data has in improving existing ground truth. Candidate training data of different types (text, audio, images) is extracted from an interaction log, and each entry is analyzed to arrive at a training value score. The analysis generates multiple component scores which are combined for the final score. The component scores may include a per-feature variability score, a cross-feature variability score, and an accuracy score. A set of the unverified entries may be presented to a user based on the training value scores, and the user can select which of the entries in the set should be included as new ground truths. The ground truths can then be updated by adding the selected entries."
 },  
 { 
  "id":"US20180308005 A1",
  "title":"Artifical Intelligence Profiling",
  "link":"https://patents.google.com/patent/US20180308005A1/",
  "authors":"Andrew R. Freed, Indervir Singh Banipal, Shikhar Kwatra",
  "year": "2018",
  "date": "2018-10-25",
  "abstract": "Technical solutions are described for controlling an artificial intelligent gaming device. For example, a computer-implemented method includes identifying an electronic opponent profile for an opponent. The computer-implemented method also includes selecting, from a profile repository, a first set of robot profiles, where robots trained using robot profiles from the first set of robot profiles have previously defeated the opponent. The computer-implemented method also includes selecting, from the profile repository, a second set of robot profiles, where robots trained using robot profiles from the second set of robot profiles have previously lost to the opponent. The computer-implemented method also includes generating a current robot profile based on the first set of robot profiles and the second robot profiles. The computer-implemented method also includes configuring a robot according to the current robot profile to play against the opponent."
 },
 { 
  "id":"US20180267835 A1",
  "title":"Managing provisioning for cloud resource allocations",
  "link":"https://patents.google.com/patent/US20180267835A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2018",
  "date": "2018-05-11",
  "abstract": "Resource provisioning to a process in a distributed computing system, such as a cloud computing system. An instruction to provision a resource is received. Portions of the resource are provisioned to the process as they become available, and prior to all portions becoming available, based on determining that the provisioning speed is greater than or equal to the use speed for the resource. If the use speed is faster, it may be actively slowed down."
 },
 { 
  "id":"US20180189417 A1",
  "title":"Dynamic faceting for personalized search and discovery",
  "link":"https://patents.google.com/patent/US20180189417A1/en",
  "authors":"Andrew R. Freed, Norbert Herman, Shubhadip Ray, Avik Sanyal",
  "year": "2018",
  "date": "2018-07-05",
  "abstract": "Methods, computer program products, and systems are presented. The methods include, for instance: determining user clusters and navigation-type clusters based on multiple information requests, and training facets and corresponding usefulness factor of the facets from the multiple information requests by machine learning. When a user submits a query, the user and the query is respectively mapped with one of the user clusters and the navigation-type clusters, and the query is customized based on the associated pair of clusters. Results of the query are obtained, ranked by usefulness of the facets as determined according to the pair of clusters, and presented to the user."
 },
 { 
  "id":"US20180165328 A1",
  "title":"Apply Corrections to an Ingested Corpus",
  "link":"https://patents.google.com/patent/US20180165328A1/en",
  "authors":"Lisa M. W. Bradley, Christina R. Carlson, Andrew R. Freed, Roderick C. Henderson",
  "year": "2018",
  "date": "2018-06-14",
  "abstract": "An approach is provided to correct documents ingested by a question answering (QA) system. A document previously ingested by the QA system is selected. A correction to the selected document is identified from one or more correction sources and the correction is applied to the selected document within the QA system. In one embodiment, the correction source is a non-ingested document, such as a published document or an issued correction. In another embodiment, the correction source is a post in a forum. In this embodiment, a statement in the ingested document is compared with a contradictory statement found in an ingested post of a threaded discussion. The statement and the contradictory statement are evaluated by the QA system. The statement in the ingested document is replaced with the contradictory statement in response to the evaluation revealing that the contradictory statement is correct and that the statement is incorrect."
 },
 { 
  "id":"US20180151181 A1",
  "title":"Cognitive Security for Voice Phishing Activity",
  "link":"https://patents.google.com/patent/US20180151181A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Donna K. Byron",
  "year": "2018",
  "date": "2018-05-31",
  "abstract": "An approach is provided in which a question answer system monitors a voice conversation between a first entity and a second entity. During the conversation, the question answer system parses the conversation into information phrases, and constructs the information phrases into a current conversation pattern. The question answer system identifies deceptive conversation properties of the current conversation by analyzing the current conversation pattern against domain-based conversation patterns. The question answer system, in turn, sends an alert message to the first entity to notify the first entity of the identified deceptive conversation properties."
 },
 { 
  "id":"US20180150453 A1",
  "title":"Contextual Analogy Resolution",
  "link":"https://patents.google.com/patent/US20180150453A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2018",
  "date": "2018-05-31",
  "abstract": "Embodiments relate to an intelligent computer platform to provide a contextual analogy response. The aspect of providing a contextual analogy response includes receiving a communication that includes an analogy. The analogy within the communication is identified and parsed into grammatical components. The grammatical components are utilized to identify a meaning of the analogy that correlates to a response statement. The grammatical structure of the analogy is analyzed and then utilized together with the grammatical components to construct an analogy representation. A response is communicated as output including both the response statement together with the analogy representation."
 },
 { 
  "id":"US20180150452 A1",
  "title":"Contextual Analogy Representation",
  "link":"https://patents.google.com/patent/US20180150452A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2018",
  "date": "2018-05-31",
  "abstract": "Embodiments relate to an intelligent computer platform to provide a contextual analogy response. The aspect of providing a contextual analogy response includes receiving a communication that includes an analogy. The analogy within the communication is identified and parsed into grammatical components. The grammatical components are utilized to identify a meaning of the analogy that correlates to a response statement. The grammatical structure of the analogy is analyzed and then utilized together with the grammatical components to construct an analogy representation. A response is communicated as output including both the response statement together with the analogy representation."
 },
 { 
  "id":"US20180150451 A1",
  "title":"Contextual Analogy Response",
  "link":"https://patents.google.com/patent/US20180150451A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2018",
  "date": "2018-05-31",
  "abstract": "Embodiments relate to an intelligent computer platform to provide a contextual analogy response. The aspect of providing a contextual analogy response includes receiving a communication that includes an analogy. The analogy within the communication is identified and parsed into grammatical components. The grammatical components are utilized to identify a meaning of the analogy that correlates to a response statement. The grammatical structure of the analogy is analyzed and then utilized together with the grammatical components to construct an analogy representation. A response is communicated as output including both the response statement together with the analogy representation."
 },
 { 
  "id":"US20180137102 A1",
  "title":"Multilingual Idiomatic Phrase Translation",
  "link":"https://patents.google.com/patent/US20180137102A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2018",
  "date": "2018-05-07",
  "abstract": "Embodiments relate to an intelligent computer platform to decipher and translate an analogical phrase. A phrase is translated, yielding a second language phrase. An idiom database is searched for one or more matching idiom phrases. The idiom phrases are ranked according to similarity to the second language phrase and idiom phrase with a highest similarity ranking is outputted as the final output."
 },
 { 
  "id":"US20180137099 A1",
  "title":"Multilingual Analogy Detection and Resolution",
  "link":"https://patents.google.com/patent/US20180137099A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2018",
  "date": "2018-05-07",
  "abstract": "Embodiments relate to an intelligent computer platform to decipher and translate an analogical phrase. A phrase in a source language is parsed into two or more grammatical sub-components, and a category for each parsed grammatical sub-component is identified. Two or more attributes and definitions of the parsed grammatical components are determined in the first language. These attributes and definitions are translated to a second language. A data source is searched for a meaning of the first language phrase, and the first language phrase is translated to a second language phrase. The second language phrase is converged with the attributes and definitions to produce a target phrase. Second language phrases are searched in a second data source and the target phrase is scored against them. A ranking is applied to the second language phrases and a final phrase is output responsive to the ranking."
 },
 { 
  "id":"US20180121332 A1",
  "title":"Proactive Cognitive Analysis for Inferring Test Case Dependencies",
  "link":"https://patents.google.com/patent/US20180121332A1/",
  "authors":"Pamela D. Andrejko, Andrew R. Freed, Richard A. Salmon, Charles S. Skinner",
  "year": "2018",
  "date": "2018-05-03",
  "abstract": "Mechanisms are provided for evaluating test cases for testing a software product based on a requirements change. The mechanisms analyze a test case corpus to identify a plurality of first relationships between elements of test cases in the test case corpus and generate a test case relationship model based on the identified plurality of first relationships. The mechanisms receive a proposed requirements change to change one or more requirements of the software product and then perform a search of the test case relationship model to identify test case relationships corresponding to the proposed requirements change. The mechanisms identify a subset of test cases affected by the proposed requirements change and generate an output specifying the identified subset of test cases."
 },
 { 
  "id":"US20180101780 A1",
  "title":"Machine Learning of Analogic Patterns",
  "link":"https://patents.google.com/patent/US20180101780A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2018",
  "date": "2018-04-12",
  "abstract": "Embodiments relate to a system, program product, and method for use with an intelligent computer platform to decipher analogical phrases. A phrase is parsed into a set of terms to reveal an analogical pattern. The set of terms are categorized according to syntactic placement and each term is placed into two or more categories according to word type patterns in the phrase to produce metadata. The metadata is matched to outcome metadata generated from a set of outcomes produced from data storage and a set of grammatical data is generated for each potential outcome. A statistical model is trained, whereby the training includes weighing and ranking each potential outcome according to degree of congruence with the syntactic placement and word type patterns of the phrase. A highest outcome is selected, the highest outcome being the potential outcome with the highest rank and a confidence level data metric is then applied."
 },
 { 
  "id":"US20180101603 A1",
  "title":"Analogic Pattern Determination",
  "link":"https://patents.google.com/patent/US20180101603A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2018",
  "date": "2018-04-12",
  "abstract": "Embodiments relate to a system, program product, and method for use with an intelligent computer platform to decipher analogical phrases. An analogy list is obtained, each analogy within the analogy list having a known meaning, and receiving an analogy phrase. A verb is identified within the phrase and a verb definition list is generated. A subject is identified within the phrase and a subject definition list is generated. An adjective is identified within the phrase and an adjective definition list is generated, including filtering adjectives to accept adjective definitions associated with the identified subject. A set of outcomes is identified, incorporating the verb definition, subject definition, and adjective definition, and a corpus is searched for evidentiary use. The outcomes are ranked in accordance to evidentiary use found in the corpus the highest ranked outcome is outputted."
 },
 { 
  "id":"US20180101602 A1",
  "title":"Analogy Outcome Determination",
  "link":"https://patents.google.com/patent/US20180101602A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2018",
  "date": "2018-04-12",
  "abstract": "Embodiments relate to a system, program product, and method for use with an intelligent computer platform to decipher analogical phrases. A phrase is compared to an analogy classifier database in order to identify a match between the analogical pattern and an analogy entry. If a match is identified, generating an idiomatic structure from the analogical pattern. An analysis is then applied whereby the analysis includes building a set of outcomes of the generated idiomatic structure based on semantic analysis into corresponding metadata for the idiomatic structure. An ontological database is searched for evidence of a pattern associated with the set of outcomes and each entry in the outcome set is scored according to a weighted calculation from the ontological database based on congruence with the pattern. An entry from the outcome set is selected based on the scoring and is represented as a meaning of the analogical pattern."
 },
 { 
  "id":"20180060211 A1",
  "title":"Applying consistent log levels to application log messages",
  "link":"https://patents.google.com/patent/US20180060211A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Scott N. Gerard, Dorian B. Miller",
  "year": "2016",
  "date": "2016-08-24",
  "abstract": "A method is provided for analyzing log message content. The computer-implemented method may include detecting, by at least one processor, log messages in an application code, identifying a log level assigned to each of the log messages, and performing natural language processing (NLP) analysis on each of the log messages by using at least keyword and synonym matching percentage analysis criteria. The computer-implemented method may further include determining, in response to the NLP analysis, a severity score of each of the log messages, and reclassifying, based on the severity score, the assigned log level of one or more of the log messages to a different log level."
 },
 { 
  "id":"US20180052914 A1",
  "title":"Content selection for usage within a policy",
  "link":"https://patents.google.com/patent/US20180052914A1/",
  "authors":"Corville O. Allen, John M. Cusick, Andrew R. Freed, Shannen B. Lambdin, Nicolas B. Lopez, Anuj Sharma",
  "year": "2016",
  "date": "2016-08-17",
  "abstract": "In an approach to content selection, one or more computer processors receive a first query from a user. The one or more computer processors retrieve a first response for the first query. The one or more computer processors determine whether the first response exceeds a threshold for a policy for content usage associated with the first response, wherein the policy for content usage specifies one or more restrictions for usage of a content asset. In response to determining the first response exceeds the threshold for the policy for content usage, the one or more computer processors select a first subset of the first response to meet the threshold for the policy for content usage. The one or more computer processors send the first subset of the first response to the user."
 },
 { 
  "id":"US20180046937 A1",
  "title":"System and method for ground truth evaluation",
  "link":"https://patents.google.com/patent/US20180046937A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Joseph N. Kozhaya, Dwi Sianto Mansjur",
  "year": "2018",
  "date": "2018-02-15",
  "abstract": "A method for training a question answering system includes providing training questions to a question answering system executing on a computer and to a plurality of subject matter experts. The question answering system generates first answers to each training question. Second answers to the training questions are received from the subject matter experts. Feature scores for each of the first answers and the second answers are generated and compared across the second answers and the first answers. Each of the feature scores is representative of a quality of an answer that is indicative of relevance to a corresponding training question. Based on the comparing, a measure of consistency of the feature scores of the second answers is determined, and a measure of consistency of the feature scores of the second answers to the first answers is determined. The measures of consistency are transmitted to the subject matter experts."
 },
 { 
  "id":"US20180046938 A1",
  "title":"System and method for ground truth evaluation",
  "link":"https://patents.google.com/patent/US20180046938A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Joseph N. Kozhaya, Dwi Sianto Mansjur",
  "year": "2018",
  "date": "2018-02-15",
  "abstract": "A method for training a question answering system includes providing training questions to a question answering system executing on a computer and to a plurality of subject matter experts. The question answering system generates first answers to each training question. Second answers to the training questions are received from the subject matter experts. Feature scores for each of the first answers and the second answers are generated and compared across the second answers and the first answers. Each of the feature scores is representative of a quality of an answer that is indicative of relevance to a corresponding training question. Based on the comparing, a measure of consistency of the feature scores of the second answers is determined, and a measure of consistency of the feature scores of the second answers to the first answers is determined. The measures of consistency are transmitted to the subject matter experts."
 },
 { 
  "id":"U20170337294 A1",
  "title":"Determining Answer Stability in a Question Answering System",
  "link":"https://patents.google.com/patent/US20170337294A1/",
  "authors":"Corville O. Allen, Lisa M. W. Bradley, Christina R. Carlson, Andrew R. Freed, Roderick C. Henderson",
  "year": "2017",
  "date": "2017-11-23",
  "abstract": "An approach is provided to determine answer stability in a question answering (QA) system. In the approach, a question submitted to a question answering (QA) system is selected and data pertaining to a candidate answers generated by the QA system are analyzed. The analysis of the data results in a stability characteristic that pertains to the candidate answers. A confidence value associated with the candidate answers is adjusted based on the respective answer's stability characteristic. One or more of the candidate answers are provided to a requestor based on the adjusted confidence values."
 },
 { 
  "id":"US20170371956 A1",
  "title":"System and method for precise domain question and answer generation for use as ground truth",
  "link":"https://patents.google.com/patent/US20170371956A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Rajesh P. Ramachandran",
  "year": "2016",
  "date": "2016-06-23",
  "abstract": "Embodiments provide a system and method for question and answer (QA) generation. Using a cognitive system having natural language processing capabilities, the QA generation system can analyze a corpus of documents, which can each have one or more headings, sub-headings, and fact statements. By analyzing the structural relationships of the one or more headings, the QA generation system can score each fact statement against the headings to score the one or more facts for use as ground truths. Strong facts, with multiple relationships to the one or more headings, can serve as the primary basis for the ground truth established for a particular knowledge domain or sub-domain. Facts can be scored based on their lexical answer type score, their header relevance score, their relationship score, their structure score, and their domain header relevance score."
 },
 { 
  "id":"US20170371955 A1",
  "title":"System and method for precise domain question and answer generation for use as ground truth",
  "link":"https://patents.google.com/patent/US20170371955A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Rajesh P. Ramachandran",
  "year": "2017",
  "date": "2017-12-28",
  "abstract": "Embodiments provide a system and method for question and answer (QA) generation. Using a cognitive system having natural language processing capabilities, the QA generation system can analyze a corpus of documents, which can each have one or more headings, sub-headings, and fact statements. By analyzing the structural relationships of the one or more headings, the QA generation system can score each fact statement against the headings to score the one or more facts for use as ground truths. Strong facts, with multiple relationships to the one or more headings, can serve as the primary basis for the ground truth established for a particular knowledge domain or sub-domain. Facts can be scored based on their lexical answer type score, their header relevance score, their relationship score, their structure score, and their domain header relevance score."
 },
 { 
  "id":"US20180011868 A1",
  "title":"Automatically Reorganize Folder/File Visualizations Based on Natural Language-Derived Intent",
  "link":"https://patents.google.com/patent/US20180011868A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Adrianus P. Vrouwenvelder",
  "year": "2016",
  "date": "2016-07-08",
  "abstract": "A method, system and computer-usable medium are disclosed for computing file system management. A corpus of content is processed to extract metadata associated with folders and files referenced by a directory structure. Natural Language Processing (NLP) operations are then performed on the corpus to generate concept and entity data associated with each folder and file, followed by performing Natural Language (NL) classification operations to generate intent classification data, which in turn is processed. to determine ranked, dominant intents for each folder and file. The corpus content, extracted metadata, concept and entity data, and ranked dominant intents are then processed to generate indexed content and term data. Application context data associated with an interaction is collected and processed to determine a user intent, which is then processed with the indexed content and term data to identify a corresponding folder and file, which in turn are provided to the user."
 },
 { 
  "id":"US20180032525 A1",
  "title":"Selecting a content summary based on relevancy",
  "link":"https://patents.google.com/patent/US20180032525A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Joseph N. Kozhaya, Dwi Sianto Mansjur",
  "year": "2016",
  "date": "2016-07-29",
  "abstract": "A computer-implemented method according to one embodiment includes identifying a plurality of different summaries for a single instance of content, calculating a relevancy score for each of the plurality of different summaries, and selecting one of the plurality of different summaries, based on the relevancy score for each of the plurality of different summaries."
 },
 { 
  "id":"US20180032609 A1",
  "title":"Determining a relevancy of a content summary",
  "link":"https://patents.google.com/patent/US20180032609A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Joseph N. Kozhaya, Dwi Sianto Mansjur",
  "year": "2016",
  "date": "2016-07-29",
  "abstract": "A computer-implemented method according to one embodiment includes identifying a summary of a single instance of content, monitoring user interaction with the summary, and determining a relevancy of the summary to the single instance of content, based on the user interaction."
 },
 { 
  "id":"US20180011868 A1",
  "title":"Automatically Reorganize Folder/File Visualizations Based on Natural Language-Derived Intent",
  "link":"https://patents.google.com/patent/US20180011868A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Adrianus P. Vrouwenvelder",
  "year": "2018"
 },
 { 
  "id":"US20170371955 A1",
  "title":"System and method for precise domain question and answer generation for use as ground truth",
  "link":"https://patents.google.com/patent/US20170371955A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Rajesh P. Ramachandran",
  "year": "2017"
 },
 { 
  "id":"US20170270250 A1",
  "title":"Building a patient's medical history from disparate information sources",
  "link":"https://www.google.com/patents/US20170270250A1",
  "authors":"Andrew R. Freed, Elizabeth T. Dettman, Michael W. Schroeder, Fernando J Suarez Saiz",
  "year": "2017"
 },
 { 
  "id":"US20170228505 A1",
  "title":"System and Method for Optimizing Visualization for Comparative Treatment Analysis from a Cognitive and Personal Approach",
  "link":"https://www.google.com/patents/US20170228505A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Zhongxiu Liu, Agustin Malo, Sandhya N. Nayak, Mitchell W. Rees-Jones, Sunil D. Shashidhara",
  "year": "2017"
 },
 { 
  "id":"US20170200081 A1",
  "title":"System and Method for Analogy Detection and Analysis in a Natural Language Question and Answering System",
  "link":"https://www.google.com/patents/US20170200081A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2017"
 },
 { 
  "id":"US20170169717 A1",
  "title":"Generating Multiple Choice Questions and Answers Based on Document Text",
  "link":"https://www.google.com/patents/US20170169717A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Roberto DeLima",
  "year": "2017"
 },
 { 
  "id":"US20170163764 A1",
  "title":"Reducing utilization speed of disk storage based on rate of resource provisioning ",
  "link":"https://www.google.com/patents/US20170163764A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2017",
  "status":"Grant",
  "issue_id":"US10007556 B2",
  "issue_link":"https://www.google.com/patents/US10007556B2",
  "abstract": "Resource provisioning to a process in a distributed computing system, such as a cloud computing system. An instruction to provision a resource is received. Portions of the resource are provisioned to the process as they become available, and prior to all portions becoming available, based on determining that the provisioning speed is greater than or equal to the use speed for the resource. If the use speed is faster, it may be actively slowed down."
 },
 { 
  "id":"US20170163552 A1",
  "title":"Managing provisioning for cloud resource allocations",
  "link":"https://www.google.com/patents/US20170163552A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2017",
  "status": "Grant",
  "issue_id": "US9876732 B2",
  "issue_link": "https://patents.google.com/patent/US9876732B2/",
  "abstract": "Resource provisioning to a process in a distributed computing system, such as a cloud computing system. An instruction to provision a resource is received. Portions of the resource are provisioned to the process as they become available, and prior to all portions becoming available, based on determining that the provisioning speed is greater than or equal to the use speed for the resource. If the use speed is faster, it may be actively slowed down."
 },
 { 
  "id":"US20170163551 A1",
  "title":"Managing provisioning for cloud resource allocations",
  "link":"https://www.google.com/patents/US20170163551A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2017",
  "status": "Grant",
  "issue_id": "US9871743 B2",
  "issue_link": "https://patents.google.com/patent/US9871743B2/",
  "abstract": "Resource provisioning to a process in a distributed computing system, such as a cloud computing system. An instruction to provision a resource is received. Portions of the resource are provisioned to the process as they become available, and prior to all portions becoming available, based on determining that the provisioning speed is greater than or equal to the use speed for the resource. If the use speed is faster, it may be actively slowed down."
 },
 { 
  "id":"US9513971 B1",
  "title":"Managing provisioning for cloud resource allocations",
  "link":"https://www.google.com/patents/US9513971B1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2016",
  "status": "Grant",
  "issue_id": "US9513971 B1",
  "issue_link": "https://patents.google.com/patent/US9513971B1/",
  "abstract": "Resource provisioning to a process in a distributed computing system, such as a cloud computing system. An instruction to provision a resource is received. Portions of the resource are provisioned to the process as they become available, and prior to all portions becoming available, based on determining that the provisioning speed is greater than or equal to the use speed for the resource. If the use speed is faster, it may be actively slowed down."
 },
 { 
  "id":"US20170139916 A1",
  "title":"Personality Relevant Search Services",
  "link":"https://www.google.com/patents/US20170139916A1",
  "authors":"Andrew R. Freed, Karl J. Cama, Norbert Herman, Shubhadip Ray",
  "year": "2017"
 },
 { 
  "id":"US20170124074 A1",
  "title":"Music Recommendation Engine",
  "link":"https://www.google.com/patents/US20170124074A1",
  "authors":"Andrew R. Freed, Karl J. Cama, Norbert Herman, Shubhadip Ray",
  "year": "2017"
 },
 { 
  "id":"US20170109390 A1",
  "title":"Answer Change Notifications Based on Changes to User Profile Information",
  "link":"https://www.google.com/patents/US20170109390A1",
  "authors":"Andrew R. Freed, Lisa M. W. Bradley, Roderick C. Henderson, Christina R. Carlson",
  "year": "2017"
 },
 { 
  "id":"US20170109333 A1",
  "title":"Criteria Modification to Improve Analysis",
  "link":"https://www.google.com/patents/US20170109333A1",
  "authors":"Andrew R. Freed, Mario J. Lorenzo, Jeffrey B. Nowicki, Jerry L. Von Berge, Daniel Z. Pierce",
  "year": "2017"
 },
 { 
  "id":"US20170060849 A1",
  "title":"Dynamic Portmanteau Word Semantic Identification",
  "link":"https://www.google.com/patents/US20170060849A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Albert A. Chung, Sorabh Murgai",
  "year": "2017",
  "status":"Grant",
  "issue_id":"US9852124 B2",
  "issue_link":"https://patents.google.com/patent/US9852124B2/"
 },
 { 
  "id":"US20170060847 A1",
  "title":"Linguistic based determination of text location origin ",
  "link":"https://www.google.com/patents/US20170060847A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Roberto DeLima, Robert L. Nielsen",
  "year": "2017"
 },
 { 
  "id":"US20170060846 A1",
  "title":"Linguistic based determination of text creation date",
  "link":"https://www.google.com/patents/US20170060846A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Roberto DeLima, Robert L. Nielsen",
  "year": "2017",
  "status":"Grant",
  "issue_id":"US9639524 B2",
  "issue_link":"https://www.google.com/patents/US9639524B2"
 },
 { 
  "id":"US20170060845 A1",
  "title":"Dynamic Portmanteau Word Semantic Identification",
  "link":"https://www.google.com/patents/US20170060845A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Albert A. Chung, Sorabh Murgai",
  "year": "2017"
 },
 { 
  "id":"US20170060832 A1",
  "title":"Linguistic based determination of text location origin",
  "link":"https://www.google.com/patents/US20170060832A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Roberto DeLima, Robert L. Nielsen",
  "year": "2017"
 },
 { 
  "id":"US20170052940 A1",
  "title":"Utilizing information associated with an action command to select an appropriate form",
  "link":"https://www.google.com/patents/US20170052940A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2017"
 },
 { 
  "id":"US20170052938 A1",
  "title":"Techniques for utilizing information associated with an action command to select an appropriate form",
  "link":"https://www.google.com/patents/US20170052938A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2017"
 },
 { 
  "id":"US20170039188 A1",
  "title":"Cognitive System with Ingestion of Natural Language Documents with Embedded Code",
  "link":"https://www.google.com/patents/US20170039188A1",
  "authors":"Andrew R. Freed, Corville O. Allen, Albert A. Chung",
  "year": "2017",
  "status":"Grant",
  "issue_id":"US9606990 B2",
  "issue_link":"https://www.google.com/patents/US9606990B2"
 },
 { 
  "id":"US20170024311 A1",
  "title":"Proactive Cognitive Analysis for Inferring Test Case Dependencies",
  "link":"https://www.google.com/patents/US20170024311A1",
  "authors":"Andrew R. Freed, Pamela D. Andrejko, Richard A. Salmon, Charles S. Skinner",
  "year": "2017"
 },
 { 
  "id":"US20170024310 A1",
  "title":"Proactive Cognitive Analysis for Inferring Test Case Dependencies",
  "link":"https://www.google.com/patents/US20170024310A1",
  "authors":"Andrew R. Freed, Pamela D. Andrejko, Richard A. Salmon, Charles S. Skinner",
  "year": "2017"
 },
 { 
  "id":"US20160359894 A1",
  "title":"Ingesting documents using multiple ingestion pipelines",
  "link":"https://patents.google.com/patent/US20160359894A1",
  "authors":"Andrew R. Freed, Pamela D. Andrejko, Cynthia M. Murch, Jan M. Nordland, Humberto R. Rivero",
  "year": "2016"
 },
 { 
  "id":"US20160342900 A1",
  "title":"Cognitive Reminder Notification Mechanisms for Answers to Questions",
  "link":"https://patents.google.com/patent/US20160342900A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Lisa M. W. Bradley, Christina R. Carlson, Roderick C. Henderson",
  "year": "2016"
 },
 { 
  "id":"US20160342886 A1",
  "title":"Cognitive Reminder Notification Mechanisms for Answers to Questions",
  "link":"https://patents.google.com/patent/US20160342886A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Lisa M. W. Bradley, Christina R. Carlson, Roderick C. Henderson",
  "year": "2016"
 },
 { 
  "id":"US20160342694 A1",
  "title":"Cognitive Reminder Notification Based on Personal User Profile and Activity Information",
  "link":"https://patents.google.com/patent/US20160342694A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Lisa M. W. Bradley, Christina R. Carlson, Roderick C. Henderson",
  "year": "2016"
 },
 { 
  "id":"US20160283360 A1",
  "title":"Searching Code Based on Learned Programming Construct Patterns and NLP Similarity",
  "link":"https://patents.google.com/patent/US20160283360A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Dana L. Price",
  "year": "2016"
 },
 { 
  "id":"US20160283347 A1",
  "title":"Searching Code Based on Learned Programming Construct Patterns and NLP Similarity",
  "link":"https://patents.google.com/patent/US20160283347A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Dana L. Price",
  "year": "2016"
 },
 { 
  "id":"US20160253294 A1",
  "title":"Inserting links that aid action completion",
  "link":"https://patents.google.com/patent/US20160253294A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160210314 A1",
  "title":"Identifying related information in dissimilar data",
  "link":"https://patents.google.com/patent/US20160210314A1",
  "authors":"Andrew R. Freed, Ahmed M. Nassar, Omar Eman, Craig M. Trim",
  "year": "2016"
 },
 { 
  "id":"US20160206960 A1",
  "title":"Creating dynamic game activities for games",
  "link":"https://patents.google.com/patent/US20160206960A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160196299 A1",
  "title":"Determining Answer Stability in a Question Answering System",
  "link":"https://patents.google.com/patent/US20160196299A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Lisa M. W. Bradley, Christina R. Carlson, Roderick C. Henderson",
  "year": "2016",
  "status":"Grant",
  "issue_id":"US9916395 B2",
  "issue_link":"https://patents.google.com/patent/US9916395B2/"
 },
 { 
  "id":"US20160196298 A1",
  "title":"Apply Corrections to an Ingested Corpus",
  "link":"https://patents.google.com/patent/US20160196298A1",
  "authors":"Andrew R. Freed, Lisa M. W. Bradley, Christina R. Carlson, Roderick C. Henderson",
  "year": "2016"
 },
 { 
  "id":"US20160196250 A1",
  "title":"Reprocess Problematic Sections of Input Documents",
  "link":"https://patents.google.com/patent/US20160196250A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Kyungae Lim",
  "year": "2016"
 },
 { 
  "id":"US20160196249 A1",
  "title":"Reprocess Problematic Sections of Input Documents",
  "link":"https://patents.google.com/patent/US20160196249A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Kyungae Lim",
  "year": "2016"
 },
 { 
  "id":"US20160171900 A1",
  "title":"Determining the Correct Answer in a Forum Thread",
  "link":"https://patents.google.com/patent/US20160171900A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Stephen J. Roorda",
  "year": "2016"
 },
 { 
  "id":"US20160171373 A1",
  "title":"Training a Question/Answer System Using Answer Keys Based on Forum Content",
  "link":"https://patents.google.com/patent/US20160171373A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Stephen J. Roorda",
  "year": "2016",
  "status":"Grant",
  "issue_id":"US9626622 B2",
  "issue_link":"https://www.google.com/patents/US9626622B2"
 },
 { 
  "id":"US20160171371 A1",
  "title":"Adaptive Testing for Answers in a Question and Answer System",
  "link":"https://patents.google.com/patent/US20160171371A1",
  "authors":"Pamela D. Andrejko, Andrew R. Freed, Cynthia M. Murch, Richard A. Salmon, Charles S. Skinner",
  "year": "2016"
 },
 { 
  "id":"US20160170972 A1",
  "title":"GENERATING NATURAL LANGUAGE TEXT SENTENCES AS TEST CASES FOR NLP ANNOTATORS WITH COMBINATORIAL TEST DESIGN",
  "link":"https://patents.google.com/patent/US20160170972A1",
  "authors":"Pamela D. Andrejko, Andrew R. Freed, Cynthia M. Murch, Robert L. Nielsen, Jan M. Nordland, Humberto R. Rivero",
  "year": "2016"
 },
 { 
  "id":"US20160170949 A1",
  "title":"Annotating Posts in a Forum Thread with Improved Data",
  "link":"https://patents.google.com/patent/US20160170949A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Stephen J. Roorda",
  "year": "2016"
 },
 { 
  "id":"US20160162527 A1",
  "title":"Automatic discovery of code and data stores that populate a user interface element",
  "link":"https://patents.google.com/patent/US20160162527A1",
  "authors":"Andrew R. Freed, Curtiss J. Howard, Saul B. Margolis, Dorian B. Miller",
  "year": "2016"
 },
 { 
  "id":"US20160162385 A1",
  "title":"Correlation of violating change sets in regression testing of computer software",
  "link":"https://patents.google.com/patent/US20160162385A1",
  "authors":"Eric Woods, Corville O. Allen, Andrew R. Freed, Albert A. Chung, Richard A. Salmon",
  "year": "2016"
 },
 { 
  "id":"US20160156578 A1",
  "title":"Ingesting Forum Content",
  "link":"https://patents.google.com/patent/US20160156578A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160154888 A1",
  "title":"Ingesting Forum Content",
  "link":"https://patents.google.com/patent/US20160154888A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160154889 A1",
  "title":"Persona-Based Conversation",
  "link":"https://patents.google.com/patent/US20160154889A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160154799 A1",
  "title":"Persona-Based Conversation",
  "link":"https://patents.google.com/patent/US20160154799A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160170957 A1",
  "title":"Inter Thread Anaphora Resolution",
  "link":"https://patents.google.com/patent/US20160170957A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Donna K. Byron",
  "year": "2016",
  "status":"Grant",
  "issue_id":"US9626352 B2",
  "issue_link":"https://www.google.com/patents/US9626352B2"
 },
 { 
  "id":"US20160154787 A1",
  "title":"Inter Thread Anaphora Resolution",
  "link":"https://patents.google.com/patent/US20160154787",
  "authors":"Corville O. Allen, Andrew R. Freed, Donna K. Byron",
  "year": "2016"
 },
 { 
  "id":"US20160147734 A1",
  "title":"Pattern Identification and Correction of Document Misinterpretations in a Natural Language Processing System",
  "link":"https://patents.google.com/patent/US20160147734A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Elizabeth T. Dettman, Michael T. Payne, Michael W. Schroeder",
  "year": "2016"
 },
 { 
  "id":"US20160147733 A1",
  "title":"Pattern Identification and Correction of Document Misinterpretations in a Natural Language Processing System",
  "link":"https://patents.google.com/patent/US20160147733A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Elizabeth T. Dettman, Michael T. Payne, Michael W. Schroeder",
  "year": "2016"
 },
 { 
  "id":"US20160171392 A1",
  "title":"Adjusting Fact-Based Answers to Consider Outcomes",
  "link":"http://patents.com/us-20160171392.html",
  "authors":"Corville O. Allen, Albert A. Chung, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160140216 A1",
  "title":"Adjusting Fact-Based Answers to Consider Outcomes",
  "link":"https://patents.google.com/patent/US20160140216A1",
  "authors":"Corville O. Allen, Albert A. Chung, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160134647 A1",
  "title":"Cognitive Detection of Malicious Documents",
  "link":"https://patents.google.com/patent/US20160134647A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160134649 A1",
  "title":"Cognitive Detection of Malicious Documents",
  "link":"https://patents.google.com/patent/US20160134649A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160121218 A1",
  "title":"Techniques for creating dynamic game activities for games",
  "link":"https://patents.google.com/patent/US20160121218A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160117485 A1",
  "title":"Criteria Conditional Override Based on Patient Information and Supporting Evidence ",
  "link":"https://patents.google.com/patent/US20160117485A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Johanna M. Cook",
  "year": "2016"
 },
 { 
  "id":"US20160117456 A1",
  "title":"Criteria Conditional Override Based on Patient Information and Supporting Evidence ",
  "link":"https://patents.google.com/patent/US20160117456A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Johanna M. Cook",
  "year": "2016"
 },
 { 
  "id":"US20160117293 A1",
  "title":"Natural language processing-assisted extract, transform, and load techniques",
  "link":"https://patents.google.com/patent/US20160117293A1",
  "authors":"Andrew R. Freed, Elizabeth T. Dettman, Michael T. Payne, Michael W. Schroeder, Joel C. Dubbels",
  "year": "2016"
 },
 { 
  "id":"US20160117286 A1",
  "title":"Natural language processing-assisted extract, transform, and load techniques",
  "link":"https://patents.google.com/patent/US20160117286A1",
  "authors":"Andrew R. Freed, Elizabeth T. Dettman, Michael T. Payne, Michael W. Schroeder, Joel C. Dubbels",
  "year": "2016"
 },
 { 
  "id":"US20160110520 A1",
  "title":"Calculating Treatment Response for a Patient",
  "link":"https://patents.google.com/patent/US20160110520A1",
  "authors":"Andrew R. Freed, Elizabeth T. Dettman, Michael T. Payne, Michael W. Schroeder",
  "year": "2016"
 },
 { 
  "id":"US20160110501 A1",
  "title":"Natural Language Processing Correction Based on Treatment Plan ",
  "link":"https://patents.google.com/patent/US20160110501A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Elizabeth T. Dettman, Michael T. Payne, Michael W. Schroeder",
  "year": "2016"
 },
 { 
  "id":"US20160104485 A1",
  "title":"Cognitive Security for Voice Phishing Activity",
  "link":"https://patents.google.com/patent/US20160104485A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Donna K. Byron",
  "year": "2016"
 },
 { 
  "id":"US20160104476 A1",
  "title":"Cognitive Security for Voice Phishing Activity",
  "link":"https://patents.google.com/patent/US20160104476A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Donna K. Byron",
  "year": "2016"
 },
 { 
  "id":"US20160099846 A1",
  "title":"Managing Network Bandwidth Based on Cognitive Analysis of Site Content Against Organizational Needs",
  "link":"http://www.google.com/patents/US20160099846",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160098576 A1",
  "title":"Cognitive Digital Security Assistant",
  "link":"https://patents.google.com/patent/US20160098576A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2016",
  "status":"Grant",
  "issue_id":"US9660687 B2",
  "issue_link":"https://www.google.com/patents/US9660687B2"
 },
 { 
  "id":"US20160078182 A1",
  "title":"Using Toxicity Level in Treatment Recommendations by Question Answering Systems",
  "link":"https://patents.google.com/patent/US20160078182A1",
  "authors":"Corville O. Allen, Roberto DeLima, Thomas J. Eggebraaten, Mark G. Megerian, Marie L. Setnes, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160078036 A1",
  "title":"Building a Domain Knowledge and Term Identity Using Crowd Sourcing",
  "link":"https://patents.google.com/patent/US20160078036A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Dorian B. Miller, Albert A. Chung",
  "year": "2016"
 },
 { 
  "id":"US20160078341 A1",
  "title":"Building a Domain Knowledge and Term Identity Using Crowd Sourcing",
  "link":"https://patents.google.com/patent/US20160078341A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Dorian B. Miller, Albert A. Chung",
  "year": "2016"
 },
 { 
  "id":"US20160055155 A1",
  "title":"Answering Superlative Questions with a Question and Answer System",
  "link":"https://patents.google.com/patent/US20160055155A1",
  "authors":"Andrew R. Freed, Corville O. Allen, Roberto DeLima, Albert A. Chung",
  "year": "2016"
 },
 { 
  "id":"US20160042275 A1",
  "title":"Debugging Code Using a Question and Answer System Based on Documentation and Code Change Records",
  "link":"https://patents.google.com/patent/US20160042275A1",
  "authors":"Andrew R. Freed, Elizabeth T. Dettman, Joel C. Dubbels, Michael W. Schroeder",
  "year": "2016"
 },
 { 
  "id":"US20160034457 A1",
  "title":"Changed Answer Notification in a Question and Answer System",
  "link":"https://patents.google.com/patent/US20160034457A1",
  "authors":"Andrew R. Freed, Lisa M. W. Bradley, Christina R. Carlson, Roderick C. Henderson",
  "year": "2016",
  "status":"Grant",
  "issue_id":"US9619513 B2",
  "issue_link":"https://www.google.com/patents/US9619513B2"
 },
 { 
  "id":"US20160026634 A1",
  "title":"Corpus Quality Analysis",
  "link":"https://patents.google.com/patent/US20160026634A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Beata J. Strack, Richard A. Salmon",
  "year": "2016",
  "status":"Grant",
  "issue_id":"US9754207 B2",
  "issue_link":"https://patents.google.com/patent/US9754207B2/"
 },
 { 
  "id":"US20150356456 A1",
  "title":"Real-Time or Frequent Ingestion by Running Pipeline in Order of Effectiveness",
  "link":"https://patents.google.com/patent/US20150356456A1",
  "authors":"Joel C. Dubbels, Andrew R. Freed, John E. Petri, Michael W. Schroeder",
  "year": "2015"
 },
 {
  "id":"US20150356203 A1",
  "title":"Determining Temporal Categories for a Domain of Content for Natural Language Processing",
  "link":"https://patents.google.com/patent/US20150356203A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Dorian B. Miller, Albert A. Chung",
  "year":"2015",
  "status":"Grant",
  "issue_id":"US9785684 B2",
  "issue_link":"https://patents.google.com/patent/US9785684B2/"
 },
 {
  "id":"US20150356181 A1",
  "title":"Effectively Ingesting Data Used for Answering Questions in a Question and Answer (QA) System",
  "link":"https://patents.google.com/patent/US20150356181A1",
  "authors":"Elizabeth T. Dettman, Joel C. Dubbels, Andrew R. Freed, John E. Petri, Michael W. Schroeder",
  "year":"2015",
  "status":"Grant",
  "issue_id":"US9542496 B2",
  "issue_link":"https://www.google.com/patents/US9542496B2"
 },
 {
  "id":"US20150356170 A1",
  "title":"Time-Based Optimization of Answer Generation in a Question and Answer System",
  "link":"http://www.google.com/patents/US20150356170",
  "authors":"Corville O. Allen, Andrew R. Freed, Dorian B. Miller, Albert A. Chung",
  "year":"2015"
 },
 {
  "id":"US20150317561 A1",
  "title":"Predicting and Enhancing Document Ingestion Time",
  "link":"https://patents.google.com/patent/US20150317561A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year":"2015",
  "status":"Grant",
  "issue_id":"US9563846 B2",
  "issue_link":"https://www.google.com/patents/US9563846B2"
 },
 {
  "id":"US9621677 B1",
  "title":"Monitoring accesses to computer source code",
  "link":"https://www.google.com/patents/US9621677B1",
  "authors":"Andrew R. Freed, Lisa M. W. Bradley, Christina R. Carlson, Roderick C. Henderson",
  "year":"2015",
  "status":"Grant",
  "issue_id":"US9621677 B1",
  "issue_link":"https://www.google.com/patents/US9621677B1"
 },
 {
  "id":"US20150310112 A1",
  "title":"Managing Questioning in a Question and Answer System",
  "link":"https://www.google.com/patents/US20150310112A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Dorian B. Miller, Albert A. Chung",
  "year":"2015",
  "status":"Grant",
  "issue_id":"US9633137 B2",
  "issue_link":"https://www.google.com/patents/US9633137B2"
 },
 {
  "id":"US20150310013 A1",
  "title":"Managing Questioning in a Question and Answer System",
  "link":"https://www.google.com/patents/US20150310013A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Dorian B. Miller, Albert A. Chung",
  "year":"2015",
  "status":"Grant",
  "issue_id":"US9633138 B2",
  "issue_link":"https://www.google.com/patents/US9633138B2"
 },
 {
  "id":"US9286290 B2",
  "title":"Producing Insight Information from Tables Using Natural Language Processing",
  "link":"https://www.google.com/patents/US9286290",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year":"2015",
  "status":"Grant",
  "issue_id":"US9286290 B2",
  "issue_link":"https://www.google.com/patents/US9286290B2"
 },
 {
  "id":"US20150309988 A1",
  "title":"Evaluating Crowd Sourced Information Using Crowd Sourced Metadata",
  "link":"https://www.google.com/patents/US20150309988",
  "authors":"Corville O. Allen, Andrew R. Freed, Dorian B. Miller, Albert A. Chung",
  "year":"2015"
 },
 {
  "id":"US20150193683 A1",
  "title":"Assisting an Expert to Answer Preexisting Questions in a Time Efficient Manner",
  "link":"https://patents.google.com/patent/US20150193683A1",
  "authors":"Andrew R. Freed, Dale J. Heeks, Joshua D. Lowry, Dana L. Price, Dorian B. Miller",
  "year":"2015"
 },
 {
  "id":"US20150100588 A1",
  "title":"Optimized Data Visualization According to Natural Language Query",
  "link":"http://www.google.com/patents/US20150100588",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year":"2013"
 }
]