[
 { 
  "id":"US20180101780 A1",
  "title":"Machine Learning of Analogic Patterns",
  "link":"https://patents.google.com/patent/US20180101780A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2018",
  "date": "2018-04-12",
  "abstract": "Embodiments relate to a system, program product, and method for use with an intelligent computer platform to decipher analogical phrases. A phrase is parsed into a set of terms to reveal an analogical pattern. The set of terms are categorized according to syntactic placement and each term is placed into two or more categories according to word type patterns in the phrase to produce metadata. The metadata is matched to outcome metadata generated from a set of outcomes produced from data storage and a set of grammatical data is generated for each potential outcome. A statistical model is trained, whereby the training includes weighing and ranking each potential outcome according to degree of congruence with the syntactic placement and word type patterns of the phrase. A highest outcome is selected, the highest outcome being the potential outcome with the highest rank and a confidence level data metric is then applied."
 },
 { 
  "id":"US20180101603 A1",
  "title":"Analogic Pattern Determination",
  "link":"https://patents.google.com/patent/US20180101603A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2018",
  "date": "2018-04-12",
  "abstract": "Embodiments relate to a system, program product, and method for use with an intelligent computer platform to decipher analogical phrases. An analogy list is obtained, each analogy within the analogy list having a known meaning, and receiving an analogy phrase. A verb is identified within the phrase and a verb definition list is generated. A subject is identified within the phrase and a subject definition list is generated. An adjective is identified within the phrase and an adjective definition list is generated, including filtering adjectives to accept adjective definitions associated with the identified subject. A set of outcomes is identified, incorporating the verb definition, subject definition, and adjective definition, and a corpus is searched for evidentiary use. The outcomes are ranked in accordance to evidentiary use found in the corpus the highest ranked outcome is outputted."
 },
 { 
  "id":"US20180101602 A1",
  "title":"Analogy Outcome Determination",
  "link":"https://patents.google.com/patent/US20180101602A1/",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2018",
  "date": "2018-04-12",
  "abstract": "Embodiments relate to a system, program product, and method for use with an intelligent computer platform to decipher analogical phrases. A phrase is compared to an analogy classifier database in order to identify a match between the analogical pattern and an analogy entry. If a match is identified, generating an idiomatic structure from the analogical pattern. An analysis is then applied whereby the analysis includes building a set of outcomes of the generated idiomatic structure based on semantic analysis into corresponding metadata for the idiomatic structure. An ontological database is searched for evidence of a pattern associated with the set of outcomes and each entry in the outcome set is scored according to a weighted calculation from the ontological database based on congruence with the pattern. An entry from the outcome set is selected based on the scoring and is represented as a meaning of the analogical pattern."
 },
 { 
  "id":"20180060211 A1",
  "title":"Applying consistent log levels to application log messages",
  "link":"https://patents.google.com/patent/US20180060211A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Scott N. Gerard, Dorian B. Miller",
  "year": "2016",
  "date": "2016-08-24",
  "abstract": "A method is provided for analyzing log message content. The computer-implemented method may include detecting, by at least one processor, log messages in an application code, identifying a log level assigned to each of the log messages, and performing natural language processing (NLP) analysis on each of the log messages by using at least keyword and synonym matching percentage analysis criteria. The computer-implemented method may further include determining, in response to the NLP analysis, a severity score of each of the log messages, and reclassifying, based on the severity score, the assigned log level of one or more of the log messages to a different log level."
 },
 { 
  "id":"US20180052914 A1",
  "title":"Content selection for usage within a policy",
  "link":"https://patents.google.com/patent/US20180052914A1/",
  "authors":"Corville O. Allen, John M. Cusick, Andrew R. Freed, Shannen B. Lambdin, Nicolas B. Lopez, Anuj Sharma",
  "year": "2016",
  "date": "2016-08-17",
  "abstract": "In an approach to content selection, one or more computer processors receive a first query from a user. The one or more computer processors retrieve a first response for the first query. The one or more computer processors determine whether the first response exceeds a threshold for a policy for content usage associated with the first response, wherein the policy for content usage specifies one or more restrictions for usage of a content asset. In response to determining the first response exceeds the threshold for the policy for content usage, the one or more computer processors select a first subset of the first response to meet the threshold for the policy for content usage. The one or more computer processors send the first subset of the first response to the user."
 },
 { 
  "id":"US20180046937 A1",
  "title":"System and method for ground truth evaluation",
  "link":"https://patents.google.com/patent/US20180046937A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Joseph N. Kozhaya, Dwi Sianto Mansjur",
  "year": "2018",
  "date": "2018-02-15",
  "abstract": "A method for training a question answering system includes providing training questions to a question answering system executing on a computer and to a plurality of subject matter experts. The question answering system generates first answers to each training question. Second answers to the training questions are received from the subject matter experts. Feature scores for each of the first answers and the second answers are generated and compared across the second answers and the first answers. Each of the feature scores is representative of a quality of an answer that is indicative of relevance to a corresponding training question. Based on the comparing, a measure of consistency of the feature scores of the second answers is determined, and a measure of consistency of the feature scores of the second answers to the first answers is determined. The measures of consistency are transmitted to the subject matter experts."
 },
 { 
  "id":"US20180046938 A1",
  "title":"System and method for ground truth evaluation",
  "link":"https://patents.google.com/patent/US20180046938A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Joseph N. Kozhaya, Dwi Sianto Mansjur",
  "year": "2018",
  "date": "2018-02-15",
  "abstract": "A method for training a question answering system includes providing training questions to a question answering system executing on a computer and to a plurality of subject matter experts. The question answering system generates first answers to each training question. Second answers to the training questions are received from the subject matter experts. Feature scores for each of the first answers and the second answers are generated and compared across the second answers and the first answers. Each of the feature scores is representative of a quality of an answer that is indicative of relevance to a corresponding training question. Based on the comparing, a measure of consistency of the feature scores of the second answers is determined, and a measure of consistency of the feature scores of the second answers to the first answers is determined. The measures of consistency are transmitted to the subject matter experts."
 },
 { 
  "id":"U20170337294 A1",
  "title":"Determining Answer Stability in a Question Answering System",
  "link":"https://patents.google.com/patent/US20170337294A1/",
  "authors":"Corville O. Allen, Lisa M. Bradley, Christina R. Carlson, Andrew R. Freed, Roderick C. Henderson",
  "year": "2017",
  "date": "2017-11-23",
  "abstract": "An approach is provided to determine answer stability in a question answering (QA) system. In the approach, a question submitted to a question answering (QA) system is selected and data pertaining to a candidate answers generated by the QA system are analyzed. The analysis of the data results in a stability characteristic that pertains to the candidate answers. A confidence value associated with the candidate answers is adjusted based on the respective answer's stability characteristic. One or more of the candidate answers are provided to a requestor based on the adjusted confidence values."
 },
 { 
  "id":"US20170371956 A1",
  "title":"System and method for precise domain question and answer generation for use as ground truth",
  "link":"https://patents.google.com/patent/US20170371956A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Rajesh P. Ramachandran",
  "year": "2016",
  "date": "2016-06-23",
  "abstract": "Embodiments provide a system and method for question and answer (QA) generation. Using a cognitive system having natural language processing capabilities, the QA generation system can analyze a corpus of documents, which can each have one or more headings, sub-headings, and fact statements. By analyzing the structural relationships of the one or more headings, the QA generation system can score each fact statement against the headings to score the one or more facts for use as ground truths. Strong facts, with multiple relationships to the one or more headings, can serve as the primary basis for the ground truth established for a particular knowledge domain or sub-domain. Facts can be scored based on their lexical answer type score, their header relevance score, their relationship score, their structure score, and their domain header relevance score."
 },
 { 
  "id":"US20170371955 A1",
  "title":"System and method for precise domain question and answer generation for use as ground truth",
  "link":"https://patents.google.com/patent/US20170371955A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Rajesh P. Ramachandran",
  "year": "2017",
  "date": "2017-12-28",
  "abstract": "Embodiments provide a system and method for question and answer (QA) generation. Using a cognitive system having natural language processing capabilities, the QA generation system can analyze a corpus of documents, which can each have one or more headings, sub-headings, and fact statements. By analyzing the structural relationships of the one or more headings, the QA generation system can score each fact statement against the headings to score the one or more facts for use as ground truths. Strong facts, with multiple relationships to the one or more headings, can serve as the primary basis for the ground truth established for a particular knowledge domain or sub-domain. Facts can be scored based on their lexical answer type score, their header relevance score, their relationship score, their structure score, and their domain header relevance score."
 },
 { 
  "id":"US20180011868 A1",
  "title":"Automatically Reorganize Folder/File Visualizations Based on Natural Language-Derived Intent",
  "link":"https://patents.google.com/patent/US20180011868A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Adrianus P. Vrouwenvelder",
  "year": "2016",
  "date": "2016-07-08",
  "abstract": "A method, system and computer-usable medium are disclosed for computing file system management. A corpus of content is processed to extract metadata associated with folders and files referenced by a directory structure. Natural Language Processing (NLP) operations are then performed on the corpus to generate concept and entity data associated with each folder and file, followed by performing Natural Language (NL) classification operations to generate intent classification data, which in turn is processed. to determine ranked, dominant intents for each folder and file. The corpus content, extracted metadata, concept and entity data, and ranked dominant intents are then processed to generate indexed content and term data. Application context data associated with an interaction is collected and processed to determine a user intent, which is then processed with the indexed content and term data to identify a corresponding folder and file, which in turn are provided to the user."
 },
 { 
  "id":"US20180032525 A1",
  "title":"Selecting a content summary based on relevancy",
  "link":"https://patents.google.com/patent/US20180032525A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Joseph N. Kozhaya, Dwi Sianto Mansjur",
  "year": "2016",
  "date": "2016-07-29",
  "abstract": "A computer-implemented method according to one embodiment includes identifying a plurality of different summaries for a single instance of content, calculating a relevancy score for each of the plurality of different summaries, and selecting one of the plurality of different summaries, based on the relevancy score for each of the plurality of different summaries."
 },
 { 
  "id":"US20180032609 A1",
  "title":"Determining a relevancy of a content summary",
  "link":"https://patents.google.com/patent/US20180032609A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Joseph N. Kozhaya, Dwi Sianto Mansjur",
  "year": "2016",
  "date": "2016-07-29",
  "abstract": "A computer-implemented method according to one embodiment includes identifying a summary of a single instance of content, monitoring user interaction with the summary, and determining a relevancy of the summary to the single instance of content, based on the user interaction."
 },
 { 
  "id":"US20180011868 A1",
  "title":"Automatically Reorganize Folder/File Visualizations Based on Natural Language-Derived Intent",
  "link":"https://patents.google.com/patent/US20180011868A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Adrianus P. Vrouwenvelder",
  "year": "2018"
 },
 { 
  "id":"US20170371955 A1",
  "title":"System and method for precise domain question and answer generation for use as ground truth",
  "link":"https://patents.google.com/patent/US20170371955A1/",
  "authors":"Corville O. Allen, Andrew R. Freed, Rajesh P. Ramachandran",
  "year": "2017"
 },
 { 
  "id":"US20170270250 A1",
  "title":"Building a patient's medical history from disparate information sources",
  "link":"https://www.google.com/patents/US20170270250A1",
  "authors":"Andrew R. Freed, Elizabeth T. Dettman, Michael W. Schroeder, Fernando J Suarez Saiz",
  "year": "2017"
 },
 { 
  "id":"US20170228505 A1",
  "title":"System and Method for Optimizing Visualization for Comparative Treatment Analysis from a Cognitive and Personal Approach",
  "link":"https://www.google.com/patents/US20170228505A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Zhongxiu Liu, Agustin Malo, Sandhya N. Nayak, Mitchell W. Rees-Jones, Sunil D. Shashidhara",
  "year": "2017"
 },
 { 
  "id":"US20170200081 A1",
  "title":"System and Method for Analogy Detection and Analysis in a Natural Language Question and Answering System",
  "link":"https://www.google.com/patents/US20170200081A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2017"
 },
 { 
  "id":"US20170169717 A1",
  "title":"Generating Multiple Choice Questions and Answers Based on Document Text",
  "link":"https://www.google.com/patents/US20170169717A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Roberto Delima",
  "year": "2017"
 },
 { 
  "id":"US20170163764 A1",
  "title":"Managing provisioning for cloud resource allocations",
  "link":"https://www.google.com/patents/US20170163764A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2017",
  "status":"Grant",
  "issue_id":"US9513971 B2",
  "issue_link":"https://www.google.com/patents/US9513971B2"
 },
 { 
  "id":"US20170163552 A1",
  "title":"Managing provisioning for cloud resource allocations",
  "link":"https://www.google.com/patents/US20170163552A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2017"
 },
 { 
  "id":"US20170163551 A1",
  "title":"Managing provisioning for cloud resource allocations",
  "link":"https://www.google.com/patents/US20170163551A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2017"
 },
 { 
  "id":"US20170139916 A1",
  "title":"Personality Relevant Search Services",
  "link":"https://www.google.com/patents/US20170139916A1",
  "authors":"Andrew R. Freed, Karl J. Cama, Norbert Herman, Shubhadip Ray",
  "year": "2017"
 },
 { 
  "id":"US20170124074 A1",
  "title":"Music Recommendation Engine",
  "link":"https://www.google.com/patents/US20170124074A1",
  "authors":"Andrew R. Freed, Karl J. Cama, Norbert Herman, Shubhadip Ray",
  "year": "2017"
 },
 { 
  "id":"US20170109390 A1",
  "title":"Answer Change Notifications Based on Changes to User Profile Information",
  "link":"https://www.google.com/patents/US20170109390A1",
  "authors":"Andrew R. Freed, Lisa M. W. Bradley, Roderick C. Henderson, Christina R. Carlson",
  "year": "2017"
 },
 { 
  "id":"US20170109333 A1",
  "title":"Criteria Modification to Improve Analysis",
  "link":"https://www.google.com/patents/US20170109333A1",
  "authors":"Andrew R. Freed, Mario J. Lorenzo, Jeffrey B. Nowicki, Jerry L. Von Berge, Daniel Z. Pierce",
  "year": "2017"
 },
 { 
  "id":"US20170060849 A1",
  "title":"Dynamic Portmanteau Word Semantic Identification",
  "link":"https://www.google.com/patents/US20170060849A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Albert A. Chung, Sorabh Murgai",
  "year": "2017",
  "status":"Grant",
  "issue_id":"US9852124 B2",
  "issue_link":"https://patents.google.com/patent/US9852124B2/"
 },
 { 
  "id":"US20170060847 A1",
  "title":"Linguistic based determination of text location origin ",
  "link":"https://www.google.com/patents/US20170060847A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Roberto Delima, Robert L. Nielsen",
  "year": "2017"
 },
 { 
  "id":"US20170060846 A1",
  "title":"Linguistic based determination of text creation date",
  "link":"https://www.google.com/patents/US20170060846A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Roberto Delima, Robert L. Nielsen",
  "year": "2017",
  "status":"Grant",
  "issue_id":"US9639524 B2",
  "issue_link":"https://www.google.com/patents/US9639524B2"
 },
 { 
  "id":"US20170060845 A1",
  "title":"Dynamic Portmanteau Word Semantic Identification",
  "link":"https://www.google.com/patents/US20170060845A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Albert A. Chung, Sorabh Murgai",
  "year": "2017"
 },
 { 
  "id":"US20170060832 A1",
  "title":"Linguistic based determination of text location origin",
  "link":"https://www.google.com/patents/US20170060832A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Roberto Delima, Robert L. Nielsen",
  "year": "2017"
 },
 { 
  "id":"US20170052940 A1",
  "title":"Utilizing information associated with an action command to select an appropriate form",
  "link":"https://www.google.com/patents/US20170052940A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2017"
 },
 { 
  "id":"US20170052938 A1",
  "title":"Techniques for utilizing information associated with an action command to select an appropriate form",
  "link":"https://www.google.com/patents/US20170052938A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2017"
 },
 { 
  "id":"US20170039188 A1",
  "title":"Cognitive System with Ingestion of Natural Language Documents with Embedded Code",
  "link":"https://www.google.com/patents/US20170039188A1",
  "authors":"Andrew R. Freed, Corville O. Allen, Albert A. Chung",
  "year": "2017",
  "status":"Grant",
  "issue_id":"US9606990 B2",
  "issue_link":"https://www.google.com/patents/US9606990B2"
 },
 { 
  "id":"US20170024311 A1",
  "title":"Proactive Cognitive Analysis for Inferring Test Case Dependencies",
  "link":"https://www.google.com/patents/US20170024311A1",
  "authors":"Andrew R. Freed, Pamela D. Andrejko, Richard A. Salmon, Charles S. Skinner",
  "year": "2017"
 },
 { 
  "id":"US20170024310 A1",
  "title":"Proactive Cognitive Analysis for Inferring Test Case Dependencies",
  "link":"https://www.google.com/patents/US20170024310A1",
  "authors":"Andrew R. Freed, Pamela D. Andrejko, Richard A. Salmon, Charles S. Skinner",
  "year": "2017"
 },
 { 
  "id":"US20160359894 A1",
  "title":"Ingesting documents using multiple ingestion pipelines",
  "link":"https://patents.google.com/patent/US20160359894A1",
  "authors":"Andrew R. Freed, Pamela D. Andrejko, Cynthia M. Murch, Jan M. Nordland, Humberto R. Rivero",
  "year": "2016"
 },
 { 
  "id":"US20160342900 A1",
  "title":"Cognitive Reminder Notification Mechanisms for Answers to Questions",
  "link":"https://patents.google.com/patent/US20160342900A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Lisa M. W. Bradley, Christina R. Carlson, Roderick C. Henderson",
  "year": "2016"
 },
 { 
  "id":"US20160342886 A1",
  "title":"Cognitive Reminder Notification Mechanisms for Answers to Questions",
  "link":"https://patents.google.com/patent/US20160342886A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Lisa M. W. Bradley, Christina R. Carlson, Roderick C. Henderson",
  "year": "2016"
 },
 { 
  "id":"US20160342694 A1",
  "title":"Cognitive Reminder Notification Based on Personal User Profile and Activity Information",
  "link":"https://patents.google.com/patent/US20160342694A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Lisa M. W. Bradley, Christina R. Carlson, Roderick C. Henderson",
  "year": "2016"
 },
 { 
  "id":"US20160283360 A1",
  "title":"Searching Code Based on Learned Programming Construct Patterns and NLP Similarity",
  "link":"https://patents.google.com/patent/US20160283360A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Dana L. Price",
  "year": "2016"
 },
 { 
  "id":"US20160283347 A1",
  "title":"Searching Code Based on Learned Programming Construct Patterns and NLP Similarity",
  "link":"https://patents.google.com/patent/US20160283347A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Dana L. Price",
  "year": "2016"
 },
 { 
  "id":"US20160253294 A1",
  "title":"Inserting links that aid action completion",
  "link":"https://patents.google.com/patent/US20160253294A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160210314 A1",
  "title":"Identifying related information in dissimilar data",
  "link":"https://patents.google.com/patent/US20160210314A1",
  "authors":"Andrew R. Freed, Ahmed M. Nassar, Omar Eman, Craig M. Trim",
  "year": "2016"
 },
 { 
  "id":"US20160206960 A1",
  "title":"Creating dynamic game activities for games",
  "link":"https://patents.google.com/patent/US20160206960A1",
  "authors":"Corville O. Allen, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160196299 A1",
  "title":"Determining Answer Stability in a Question Answering System",
  "link":"https://patents.google.com/patent/US20160196299A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Lisa M. Bradley, Christina R. Carlson, Roderick C. Henderson",
  "year": "2016",
  "status":"Grant",
  "issue_id":"US9916395 B2",
  "issue_link":"https://patents.google.com/patent/US9916395B2/"
 },
 { 
  "id":"US20160196298 A1",
  "title":"Apply Corrections to an Ingested Corpus",
  "link":"https://patents.google.com/patent/US20160196298A1",
  "authors":"Andrew R. Freed, Lisa M. Bradley, Christina R. Carlson, Roderick C. Henderson",
  "year": "2016"
 },
 { 
  "id":"US20160196250 A1",
  "title":"Reprocess Problematic Sections of Input Documents",
  "link":"https://patents.google.com/patent/US20160196250A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Kyungae Lim",
  "year": "2016"
 },
 { 
  "id":"US20160196249 A1",
  "title":"Reprocess Problematic Sections of Input Documents",
  "link":"https://patents.google.com/patent/US20160196249A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Kyungae Lim",
  "year": "2016"
 },
 { 
  "id":"US20160171900 A1",
  "title":"Determining the Correct Answer in a Forum Thread",
  "link":"https://patents.google.com/patent/US20160171900A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Stephen J. Roorda",
  "year": "2016"
 },
 { 
  "id":"US20160171373 A1",
  "title":"Training a Question/Answer System Using Answer Keys Based on Forum Content",
  "link":"https://patents.google.com/patent/US20160171373A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Stephen J. Roorda",
  "year": "2016",
  "status":"Grant",
  "issue_id":"US9626622 B2",
  "issue_link":"https://www.google.com/patents/US9626622B2"
 },
 { 
  "id":"US20160171371 A1",
  "title":"Adaptive Testing for Answers in a Question and Answer System",
  "link":"https://patents.google.com/patent/US20160171371A1",
  "authors":"Pamela D. Andrejko, Andrew R. Freed, Cynthia M. Murch, Richad A. Salmon, Charles S. Skinner",
  "year": "2016"
 },
 { 
  "id":"US20160170972 A1",
  "title":"GENERATING NATURAL LANGUAGE TEXT SENTENCES AS TEST CASES FOR NLP ANNOTATORS WITH COMBINATORIAL TEST DESIGN",
  "link":"https://patents.google.com/patent/US20160170972A1",
  "authors":"Pamela D. Andrejko, Andrew R. Freed, Cynthia M. Murch, Robert L. Nielsen, Jan M. Nordland, Humberto R. Rivero",
  "year": "2016"
 },
 { 
  "id":"US20160170949 A1",
  "title":"Annotating Posts in a Forum Thread with Improved Data",
  "link":"https://patents.google.com/patent/US20160170949A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Stephen J. Roorda",
  "year": "2016"
 },
 { 
  "id":"US20160162527 A1",
  "title":"Automatic discovery of code and data stores that populate a user interface element",
  "link":"https://patents.google.com/patent/US20160162527A1",
  "authors":"Andrew R. Freed, Curtiss J. Howard, Saul B. Margolis, Dorian B. Miller",
  "year": "2016"
 },
 { 
  "id":"US20160162385 A1",
  "title":"Correlation of violating change sets in regression testing of computer software",
  "link":"https://patents.google.com/patent/US20160162385A1",
  "authors":"Eric Woods, Corville O. Allen, Andrew R. Freed, Albert A. Chung, Richard A. Salmon",
  "year": "2016"
 },
 { 
  "id":"US20160156578 A1",
  "title":"Ingesting Forum Content",
  "link":"https://patents.google.com/patent/US20160156578A1",
  "authors":"Corville O. Allen and Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160154888 A1",
  "title":"Ingesting Forum Content",
  "link":"https://patents.google.com/patent/US20160154888A1",
  "authors":"Corville O. Allen and Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160154889 A1",
  "title":"Persona-Based Conversation",
  "link":"https://patents.google.com/patent/US20160154889A1",
  "authors":"Corville O. Allen and Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160154799 A1",
  "title":"Persona-Based Conversation",
  "link":"https://patents.google.com/patent/US20160154799A1",
  "authors":"Corville O. Allen and Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160170957 A1",
  "title":"Inter Thread Anaphora Resolution",
  "link":"https://patents.google.com/patent/US20160170957A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Donna K. Byron",
  "year": "2016",
  "status":"Grant",
  "issue_id":"US9626352 B2",
  "issue_link":"https://www.google.com/patents/US9626352B2"
 },
 { 
  "id":"US20160154787 A1",
  "title":"Inter Thread Anaphora Resolution",
  "link":"https://patents.google.com/patent/US20160154787",
  "authors":"Corville O. Allen, Andrew R. Freed, Donna K. Byron",
  "year": "2016"
 },
 { 
  "id":"US20160147734 A1",
  "title":"Pattern Identification and Correction of Document Misinterpretations in a Natural Language Processing System",
  "link":"https://patents.google.com/patent/US20160147734A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Elizabeth T. Dettman, Michael T. Payne, Michael W. Schroeder",
  "year": "2016"
 },
 { 
  "id":"US20160147733 A1",
  "title":"Pattern Identification and Correction of Document Misinterpretations in a Natural Language Processing System",
  "link":"https://patents.google.com/patent/US20160147733A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Elizabeth T. Dettman, Michael T. Payne, Michael W. Schroeder",
  "year": "2016"
 },
 { 
  "id":"US20160171392 A1",
  "title":"Adjusting Fact-Based Answers to Consider Outcomes",
  "link":"http://patents.com/us-20160171392.html",
  "authors":"Corville O. Allen, Albert A. Chung, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160140216 A1",
  "title":"Adjusting Fact-Based Answers to Consider Outcomes",
  "link":"https://patents.google.com/patent/US20160140216A1",
  "authors":"Corville O. Allen, Albert A. Chung, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160134647 A1",
  "title":"Cognitive Detection of Malicious Documents",
  "link":"https://patents.google.com/patent/US20160134647A1",
  "authors":"Corville O. Allen and Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160134649 A1",
  "title":"Cognitive Detection of Malicious Documents",
  "link":"https://patents.google.com/patent/US20160134649A1",
  "authors":"Corville O. Allen and Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160121218 A1",
  "title":"Techniques for creating dynamic game activities for games",
  "link":"https://patents.google.com/patent/US20160121218A1",
  "authors":"Corville O. Allen and Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160117485 A1",
  "title":"Criteria Conditional Override Based on Patient Information and Supporting Evidence ",
  "link":"https://patents.google.com/patent/US20160117485A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Johanna M. Cook",
  "year": "2016"
 },
 { 
  "id":"US20160117456 A1",
  "title":"Criteria Conditional Override Based on Patient Information and Supporting Evidence ",
  "link":"https://patents.google.com/patent/US20160117456A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Johanna M. Cook",
  "year": "2016"
 },
 { 
  "id":"US20160117293 A1",
  "title":"Natural language processing-assisted extract, transform, and load techniques",
  "link":"https://patents.google.com/patent/US20160117293A1",
  "authors":"Andrew R. Freed, Elizabeth T. Dettman, Michael T. Payne, Michael W. Schroeder, Joel C. Dubbels",
  "year": "2016"
 },
 { 
  "id":"US20160117286 A1",
  "title":"Natural language processing-assisted extract, transform, and load techniques",
  "link":"https://patents.google.com/patent/US20160117286A1",
  "authors":"Andrew R. Freed, Elizabeth T. Dettman, Michael T. Payne, Michael W. Schroeder, Joel C. Dubbels",
  "year": "2016"
 },
 { 
  "id":"US20160110520 A1",
  "title":"Calculating Treatment Response for a Patient",
  "link":"https://patents.google.com/patent/US20160110520A1",
  "authors":"Andrew R. Freed, Elizabeth T. Dettman, Michael T. Payne, Michael W. Schroeder",
  "year": "2016"
 },
 { 
  "id":"US20160110501 A1",
  "title":"Natural Language Processing Correction Based on Treatment Plan ",
  "link":"https://patents.google.com/patent/US20160110501A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Elizabeth T. Dettman, Michael T. Payne, Michael W. Schroeder",
  "year": "2016"
 },
 { 
  "id":"US20160104485 A1",
  "title":"Cognitive Security for Voice Phishing Activity",
  "link":"https://patents.google.com/patent/US20160104485A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Donna K. Byron",
  "year": "2016"
 },
 { 
  "id":"US20160104476 A1",
  "title":"Cognitive Security for Voice Phishing Activity",
  "link":"https://patents.google.com/patent/US20160104476A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Donna K. Byron",
  "year": "2016"
 },
 { 
  "id":"US20160099846 A1",
  "title":"Managing Network Bandwidth Based on Cognitive Analysis of Site Content Against Organizational Needs",
  "link":"http://www.google.com/patents/US20160099846",
  "authors":"Corville O. Allen and Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160098576 A1",
  "title":"Cognitive Digital Security Assistant",
  "link":"https://patents.google.com/patent/US20160098576A1",
  "authors":"Corville O. Allen and Andrew R. Freed",
  "year": "2016",
  "status":"Grant",
  "issue_id":"US9660687 B2",
  "issue_link":"https://www.google.com/patents/US9660687B2"
 },
 { 
  "id":"US20160078182 A1",
  "title":"Using Toxicity Level in Treatment Recommendations by Question Answering Systems",
  "link":"https://patents.google.com/patent/US20160078182A1",
  "authors":"Corville O. Allen, Roberto Delima, Thomas J. Eggebraaten, Mark G. Megerian, Marie L. Setnes, Andrew R. Freed",
  "year": "2016"
 },
 { 
  "id":"US20160078036 A1",
  "title":"Building a Domain Knowledge and Term Identity Using Crowd Sourcing",
  "link":"https://patents.google.com/patent/US20160078036A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Dorian B. Miller, Albert A. Chung",
  "year": "2016"
 },
 { 
  "id":"US20160078341 A1",
  "title":"Building a Domain Knowledge and Term Identity Using Crowd Sourcing",
  "link":"https://patents.google.com/patent/US20160078341A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Dorian B. Miller, Albert A. Chung",
  "year": "2016"
 },
 { 
  "id":"US20160055155 A1",
  "title":"Answering Superlative Questions with a Question and Answer System",
  "link":"https://patents.google.com/patent/US20160055155A1",
  "authors":"Andrew R. Freed, Corville O. Allen, Roberto Delima, Albert A. Chung",
  "year": "2016"
 },
 { 
  "id":"US20160042275 A1",
  "title":"Debugging Code Using a Question and Answer System Based on Documentation and Code Change Records",
  "link":"https://patents.google.com/patent/US20160042275A1",
  "authors":"Andrew R. Freed, Elizabeth T. Dettman, Joel C. Dubbels, Michael W. Schroeder",
  "year": "2016"
 },
 { 
  "id":"US20160034457 A1",
  "title":"Changed Answer Notification in a Question and Answer System",
  "link":"https://patents.google.com/patent/US20160034457A1",
  "authors":"Andrew R. Freed, Lisa M. W. Bradley, Christina R. Carlson, Roderick C. Henderson",
  "year": "2016",
  "status":"Grant",
  "issue_id":"US9619513 B2",
  "issue_link":"https://www.google.com/patents/US9619513B2"
 },
 { 
  "id":"US20160026634 A1",
  "title":"Corpus Quality Analysis",
  "link":"https://patents.google.com/patent/US20160026634A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Beata J. Strack, Richard A. Salmon",
  "year": "2016",
  "status":"Grant",
  "issue_id":"US9754207 B2",
  "issue_link":"https://patents.google.com/patent/US9754207B2/"
 },
 { 
  "id":"US20150356456 A1",
  "title":"Real-Time or Frequent Ingestion by Running Pipeline in Order of Effectiveness",
  "link":"https://patents.google.com/patent/US20150356456A1",
  "authors":"Joel C. Dubbels, Andrew R. Freed, John E. Petri, Michael W. Schroeder",
  "year": "2015"
 },
 {
  "id":"US20150356203 A1",
  "title":"Determining Temporal Categories for a Domain of Content for Natural Language Processing",
  "link":"https://patents.google.com/patent/US20150356203A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Dorian B. Miller, Albert A. Chung",
  "year":"2015",
  "status":"Grant",
  "issue_id":"US9785684 B2",
  "issue_link":"https://patents.google.com/patent/US9785684B2/"
 },
 {
  "id":"US20150356181 A1",
  "title":"Effectively Ingesting Data Used for Answering Questions in a Question and Answer (QA) System",
  "link":"https://patents.google.com/patent/US20150356181A1",
  "authors":"Elizabeth T. Dettman, Joel C. Dubbels, Andrew R. Freed, John E. Petri, Michael W. Schroeder",
  "year":"2015",
  "status":"Grant",
  "issue_id":"US9542496 B2",
  "issue_link":"https://www.google.com/patents/US9542496B2"
 },
 {
  "id":"US20150356170 A1",
  "title":"Time-Based Optimization of Answer Generation in a Question and Answer System",
  "link":"http://www.google.com/patents/US20150356170",
  "authors":"Corville O. Allen, Andrew R. Freed, Dorian B. Miller, Albert A. Chung",
  "year":"2015"
 },
 {
  "id":"US20150317561 A1",
  "title":"Predicting and Enhancing Document Ingestion Time",
  "link":"https://patents.google.com/patent/US20150317561A1",
  "authors":"Corville O. Allen and Andrew R. Freed",
  "year":"2015",
  "status":"Grant",
  "issue_id":"US9563846 B2",
  "issue_link":"https://www.google.com/patents/US9563846B2"
 },
 {
  "id":"US9621677 B1",
  "title":"Monitoring accesses to computer source code",
  "link":"https://www.google.com/patents/US9621677B1",
  "authors":"Andrew R. Freed, Lisa M. W. Bradley, Christina R. Carlson, Roderick C. Henderson",
  "year":"2015",
  "status":"Grant",
  "issue_id":"US9621677 B1",
  "issue_link":"https://www.google.com/patents/US9621677B1"
 },
 {
  "id":"US20150310112 A1",
  "title":"Managing Questioning in a Question and Answer System",
  "link":"https://www.google.com/patents/US20150310112A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Dorian B. Miller, Albert A. Chung",
  "year":"2015",
  "status":"Grant",
  "issue_id":"US9633137 B2",
  "issue_link":"https://www.google.com/patents/US9633137B2"
 },
 {
  "id":"US20150310013 A1",
  "title":"Managing Questioning in a Question and Answer System",
  "link":"https://www.google.com/patents/US20150310013A1",
  "authors":"Corville O. Allen, Andrew R. Freed, Dorian B. Miller, Albert A. Chung",
  "year":"2015",
  "status":"Grant",
  "issue_id":"US9633138 B2",
  "issue_link":"https://www.google.com/patents/US9633138B2"
 },
 {
  "id":"US9286290 B2",
  "title":"Producing Insight Information from Tables Using Natural Language Processing",
  "link":"https://www.google.com/patents/US9286290",
  "authors":"Corville O. Allen and Andrew R. Freed",
  "year":"2015",
  "status":"Grant",
  "issue_id":"US9286290 B2",
  "issue_link":"https://www.google.com/patents/US9286290B2"
 },
 {
  "id":"US20150309988 A1",
  "title":"Evaluating Crowd Sourced Information Using Crowd Sourced Metadata",
  "link":"https://www.google.com/patents/US20150309988",
  "authors":"Corville O. Allen, Andrew R. Freed, Dorian B. Miller, Albert A. Chung",
  "year":"2015"
 },
 {
  "id":"US20150193683 A1",
  "title":"Assisting an Expert to Answer Preexisting Questions in a Time Efficient Manner",
  "link":"https://patents.google.com/patent/US20150193683A1",
  "authors":"Andrew R. Freed, Dale J. Heeks, Joshua D. Lowry, Dana L. Price, Dorian B. Miller",
  "year":"2015"
 },
 {
  "id":"US20150100588 A1",
  "title":"Optimized Data Visualization According to Natural Language Query",
  "link":"http://www.google.com/patents/US20150100588",
  "authors":"Corville O. Allen and Andrew R. Freed",
  "year":"2013"
 }
]